[
  {
    "id": "09RSWGZcccIfCAMSUjwO",
    "title": {
      "en": "Toasted Marshmallow Ice Cream"
    },
    "summary": {
      "en": "If you want to add more <b>gluten free</b> recipes to your recipe box, Toasted Marshmallow Ice Cream might be a recipe you should try. This recipe serves 8 and costs 75 cents per serving. One serving contains <b>349 calories</b>, <b>5g of protein</b>, and <b>25g of fat</b>. It works well as a very affordable dessert for <b>Summer</b>. 69 people have tried and liked this recipe. Head to the store and pick up egg yolks, vanillan extract, heavy cream, and a few other things to make it today. It is brought to you by Foodista. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. With a spoonacular <b>score of 24%</b>, this dish is rather bad. <a href=\"https://spoonacular.com/recipes/toasted-marshmallow-ice-cream-591663\">Toasted Marshmallow Ice Cream</a>, <a href=\"https://spoonacular.com/recipes/toasted-marshmallow-swirl-ice-cream-494292\">Toasted Marshmallow Swirl Ice Cream</a>, and <a href=\"https://spoonacular.com/recipes/toasted-marshmallow-ice-cream-cake-349264\">Toasted Marshmallow Ice Cream Cake</a> are very similar to this recipe."
    },
    "instructions": {
      "en": "<ol><li>In a heavy bottomed saucepan, heat the milk, salt and 1/4 cup sugar over med-low heat until steaming but not boiling and the sugar is dissolved. Remove from heat. Add the vanilla bean paste and let stand for 1 hour.</li><li>Fill a large bowl with ice and water. Place a small bowl in the ice water and add the heavy cream. Top the small bowl with a wire strainer and set aside.</li><li>In a small bowl, whisk together the egg yolks and remaining 1/4 cup sugar until light in color and ribbons begin to form. Reheat the milk mixture over med-low heat and slowly add to the egg mixture whisking constantly so the eggs do not scramble. Return the milk/egg mixture to the pan and heat. Stir constantly with a heat-resistant spatula being sure to scrape the sides and bottom until it begins to thicken (it will coat the back of the spatula).</li><li>Strain the milk mixture into the cream, remove the strainer and stir to combine. Cover with plastic wrap and chill in the refrigerator for 2 hours or overnight.</li><li>Pour the mixture into the freezer can of an electric ice cream maker and freeze according to the manufacturer's instructions. When the mixture reaches soft serve consistency, add the toasted marshmallows one at a time and continue churning until combined. Use a spatula to push any marshmallows through that may stick to the churn. Transfer the ice cream to a freezer safe container and freeze.</li></ol>"
    },
    "ingredients": [
      {
        "en": "4 egg yolks"
      },
      {
        "en": "1/2 cup granulated sugar, divided"
      },
      {
        "en": "2 cups heavy cream"
      },
      {
        "en": "1/8 teaspoon kosher salt"
      },
      {
        "en": "14 toasted marshmallows"
      },
      {
        "en": "1 tablespoon vanilla bean paste or vanilla extract"
      },
      {
        "en": "1 1/4 cups whole milk"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/663462-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 8,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "dessert"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "sauce pan"
      },
      {
        "en": "bowl"
      },
      {
        "en": "plastic wrap"
      },
      {
        "en": "whisk"
      },
      {
        "en": "sieve"
      },
      {
        "en": "spatula"
      },
      {
        "en": "frying pan"
      },
      {
        "en": "ice cream machine"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/7TP3JMNK/toasted-marshmallow-ice-cream"
  },
  {
    "id": "2GIBEDuly3hatm6Vqmcl",
    "title": {
      "en": "Baked Cinnamon Apple Wedges"
    },
    "summary": {
      "en": "Need a <b>gluten free, dairy free, paleolithic, and lacto ovo vegetarian side dish</b>? Baked Cinnamon Apple Wedges could be a great recipe to try. One portion of this dish contains approximately <b>1g of protein</b>, <b>1g of fat</b>, and a total of <b>120 calories</b>. For <b>87 cents per serving</b>, this recipe <b>covers 4%</b> of your daily requirements of vitamins and minerals. This recipe serves 1. If you have nutmeg, maple syrup, cinnamon, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. 2 people were impressed by this recipe. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. Overall, this recipe earns a <b>not so amazing spoonacular score of 35%</b>. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/baked-cinnamon-apple-wedges-1369471\">Baked Cinnamon Apple Wedges</a>, <a href=\"https://spoonacular.com/recipes/apple-cinnamon-baked-oatmeal-622523\">Apple Cinnamon Baked Oatmeal</a>, and <a href=\"https://spoonacular.com/recipes/cinnamon-baked-apple-slices-1361101\">Cinnamon Baked Apple Slices</a>."
    },
    "instructions": {
      "en": "Preheat oven to 180 degrees\nCut the apple into about 10-12 wedges and mix it with the rest of the ingredients.\nPlace the apple wedges in a small baking dish or on a baking tray  aim for a single layer.\nBake in the oven for 10 minutes. The apples should be golden brown and cooked all the way through.\nServe while warm."
    },
    "ingredients": [
      {
        "en": "1 apple"
      },
      {
        "en": "1 tsp maple syrup"
      },
      {
        "en": "1/2 tsp cinnamon"
      },
      {
        "en": "1/4 tsp nutmeg"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/633548-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 1,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      },
      {
        "en": "paleolithic"
      },
      {
        "en": "lacto ovo vegetarian"
      },
      {
        "en": "primal"
      },
      {
        "en": "vegan"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "side dish"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "oven"
      },
      {
        "en": "baking pan"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/XJ3WCV8B/baked-cinnamon-apple-wedges"
  },
  {
    "id": "2GtU5JXSEzKSQY2XykfU",
    "title": {
      "en": "Wild Salmon Cakes"
    },
    "summary": {
      "en": "Wild Salmon Cakes might be just the main course you are searching for. This dairy free and pescatarian recipe serves 4 and costs <b>$2.69 per serving</b>. One serving contains <b>209 calories</b>, <b>25g of protein</b>, and <b>9g of fat</b>. Head to the store and pick up panko, onion, egg, and a few other things to make it today. This recipe is liked by 4 foodies and cooks. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. It is brought to you by Foodista. Overall, this recipe earns a <b>solid spoonacular score of 77%</b>. Try <a href=\"https://spoonacular.com/recipes/wild-salmon-cakes-1632267\">Wild Salmon Cakes</a>, <a href=\"https://spoonacular.com/recipes/potato-and-wild-salmon-cakes-with-ginger-and-scallions-317330\">Potato-and-Wild-Salmon Cakes with Ginger and Scallions</a>, and <a href=\"https://spoonacular.com/recipes/potato-and-wild-salmon-cakes-with-ginger-and-scallions-702583\">Potato-and-Wild-Salmon Cakes with Ginger and Scallions</a> for similar recipes."
    },
    "instructions": {
      "en": "Mince the salmon.\nIn a bowl, whip the egg; add the diced onion, capers and salmon until ingredients are incorporated\nAdd the panko bread crumbs until combined.\nForm into 4 patties and place on a hot grill for about 2-3 minutes on each side, or in a 350 degree oven for 15-20 minutes."
    },
    "ingredients": [
      {
        "en": "1 pound wild salmon fillet, boneless and skinless, minced"
      },
      {
        "en": "1/4 red onion, diced"
      },
      {
        "en": "1 teaspoon capers"
      },
      {
        "en": "1 egg"
      },
      {
        "en": "1/2 cup panko"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/665348-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 4,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "dairy free"
      },
      {
        "en": "pescatarian"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "bowl"
      },
      {
        "en": "grill"
      },
      {
        "en": "oven"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/TQ7FYHL4/wild-salmon-cakes"
  },
  {
    "id": "3ru3DURic8JYxKZvK1OW",
    "title": {
      "en": "Lemon Fish with Sweet Potatoes"
    },
    "summary": {
      "en": "Lemon Fish with Sweet Potatoes might be just the hor d'oeuvre you are searching for. Watching your figure? This gluten free and pescatarian recipe has <b>761 calories</b>, <b>11g of protein</b>, and <b>44g of fat</b> per serving. This recipe serves 1. For <b>$3.13 per serving</b>, this recipe <b>covers 37%</b> of your daily requirements of vitamins and minerals. 3 people have tried and liked this recipe. Head to the store and pick up lemon, croaker fish, seasoning cube, and a few other things to make it today. It is brought to you by Afrolems. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. Overall, this recipe earns an <b>amazing spoonacular score of 82%</b>. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/roasted-fish-with-cumin-sweet-potatoes-2275\">Roasted Fish With Cumin Sweet Potatoes</a>, <a href=\"https://spoonacular.com/recipes/chile-baked-fish-with-sweet-potatoes-4075\">Chile- Baked Fish With Sweet Potatoes</a>, and <a href=\"https://spoonacular.com/recipes/fish-packets-with-potatoes-lemon-capers-697755\">Fish Packets with Potatoes, Lemon & Capers</a>."
    },
    "instructions": {
      "en": "Wash and place your potatoes in a pot and bring to boil till soft. Peel, slice and set aside.Season your fish with pepper soup spice and set aside.Preheat your butter and vegetable oil and fry your onions and pepper on medium heat for one minute.Add your fish and squeeze your lemon over the fish and sprinkle the seasoning cube and allow to cook on low heat. When brown, flip over so it can brown on the other side.For your sauce, heat up your coconut milk, garlic, seasoning cube and parsley and allow to thicken a bit.Serve the fish and potato with the sauce drizzled over it and garnish with extra chili. "
    },
    "ingredients": [
      {
        "en": "1 tablespoon of melted butter"
      },
      {
        "en": "1 Chili pepper"
      },
      {
        "en": "Coconut Sauce"
      },
      {
        "en": "1/2 cup of Coconut milk"
      },
      {
        "en": "2 Croaker Fish Fillet"
      },
      {
        "en": "1 garlic clove"
      },
      {
        "en": "1 seasoning cube"
      },
      {
        "en": "Half of a seasoning cube"
      },
      {
        "en": "1/4 lemon slice"
      },
      {
        "en": "1/2 bulb of Red Onion"
      },
      {
        "en": "Sprinkle of Parsley"
      },
      {
        "en": "1 tablespoon of pepper soup spice"
      },
      {
        "en": "1 large Sweet Potato"
      },
      {
        "en": "1 teaspoon of vegetable Oil"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/716369-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 1,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "pescatarian"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "antipasti"
      },
      {
        "en": "starter"
      },
      {
        "en": "snack"
      },
      {
        "en": "appetizer"
      },
      {
        "en": "antipasto"
      },
      {
        "en": "hor d'oeuvre"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "pot"
      }
    ],
    "sourceUrl": "https://www.afrolems.com/2016/02/08/lemon-fish-sweet-potatoes/"
  },
  {
    "id": "5RXgEuFXCfRHOUdQlhGV",
    "title": {
      "en": "Shortbread Lemon Bars"
    },
    "summary": {
      "en": "You can never have too many dessert recipes, so give Shortbread Lemon Bars a try. This lacto ovo vegetarian recipe serves 9 and costs <b>36 cents per serving</b>. One portion of this dish contains about <b>4g of protein</b>, <b>9g of fat</b>, and a total of <b>247 calories</b>. From preparation to the plate, this recipe takes around <b>1 hour and 10 minutes</b>. It is brought to you by Pick Fresh Foods. Plenty of people made this recipe, and 186 would say it hit the spot. Head to the store and pick up salt, butter, powdered sugar, and a few other things to make it today. Overall, this recipe earns a <b>rather bad spoonacular score of 20%</b>. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/strawberry-lemon-shortbread-bars-130364\">Strawberry Lemon Shortbread Bars</a>, <a href=\"https://spoonacular.com/recipes/luscious-lemon-shortbread-bars-365704\">Luscious Lemon Shortbread Bars</a>, and <a href=\"https://spoonacular.com/recipes/strawberry-lemon-shortbread-bars-171931\">Strawberry Lemon Shortbread Bars</a>."
    },
    "instructions": {
      "en": "Preheat oven to 350.\nCoat a 8 inch square baking ban with no stick cooking spray or line with foil.\nCombine flour, confectioners sugar and salt in large mixing bowl.\nAdd butter and cut into flour with a fork or crumble with your fingers to combine until flour resembles coarse meal.\nPress mixture with fingers into even layer over the bottom of the pan.\nRefrigerate for 15 minutes, then bake about 20 minutes, or until golden brown.\nCombine sugar and flour for the filling in a medium mixing bowl. Whisk in the eggs.\nAdd lemon juice, milk, and salt; stir to combine.\nPour over baked crust. Sprinkle lemon zest over the filling.\nReturn to oven and bake 20 minutes, or until firmly set.\nCool on rack. Remove from pan and cut into 9 squares.\nDust with powdered sugar."
    },
    "ingredients": [
      {
        "en": "¼ cup all purpose flour"
      },
      {
        "en": "¾ cup all purpose flour"
      },
      {
        "en": "3 eggs"
      },
      {
        "en": "½ cup fresh lemon juice"
      },
      {
        "en": "2 tsp lemon zest, finely grated"
      },
      {
        "en": "3 Tbsp 0% fat milk"
      },
      {
        "en": "1/3 cup powdered sugar"
      },
      {
        "en": "¼ tsp salt"
      },
      {
        "en": "1 cup sugar"
      },
      {
        "en": "6 tbsp unsalted butter, chilled, cubed"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/1005367-556x370.jpg",
    "readyInMinutes": 70,
    "servings": 9,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "lacto ovo vegetarian"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "dessert"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "oven"
      },
      {
        "en": "aluminum foil"
      },
      {
        "en": "mixing bowl"
      },
      {
        "en": "frying pan"
      },
      {
        "en": "whisk"
      }
    ],
    "sourceUrl": "https://pickfreshfoods.com/shortbread-lemon-bars/"
  },
  {
    "id": "5w9omvO3VLKjeOm3SVDU",
    "title": {
      "en": "Broccoli Oatmeal Breakfast Casserole"
    },
    "summary": {
      "en": "Broccoli Oatmeal Breakfast Casserole is a main course that serves 4. One portion of this dish contains around <b>13g of protein</b>, <b>11g of fat</b>, and a total of <b>269 calories</b>. For <b>61 cents per serving</b>, this recipe <b>covers 20%</b> of your daily requirements of vitamins and minerals. It can be enjoyed any time, but it is especially good for <b>Christmas</b>. This recipe is liked by 2 foodies and cooks. A mixture of baking powder, broccoli florets, salt, and a handful of other ingredients are all it takes to make this recipe so flavorful. It is a good option if you're following a <b>gluten free and lacto ovo vegetarian</b> diet. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 59%</b>. This score is pretty good. Similar recipes are <a href=\"https://spoonacular.com/recipes/broccoli-oatmeal-breakfast-casserole-1381179\">Broccoli Oatmeal Breakfast Casserole</a>, <a href=\"https://spoonacular.com/recipes/broccoli-and-cheese-breakfast-casserole-521474\">Broccoli and Cheese Breakfast Casserole</a>, and <a href=\"https://spoonacular.com/recipes/broccoli-leek-breakfast-casserole-29457\">Broccoli & Leek Breakfast Casserole</a>."
    },
    "instructions": {
      "en": "<ol><li>Preheat the oven at 350 degree Fahrenheit. Prepare 8 inch square baking dish with cooking spray.</li><li>Grind the broccoli separately in a food processor and combine it with all the dry ingredients in a mixing bowl.</li><li>In another bowl combine all the wet ingredients.</li><li>Pour the wet ingredients into the dry ingredients and mix well.</li><li>Spoon the batter into the baking dish and put it in the oven.</li><li>Bake it for 25-30 minutes or until the fork comes out clean.</li><li>Cut into desired size and serve hot.</li></ol>"
    },
    "ingredients": [
      {
        "en": "2 tsp baking powder"
      },
      {
        "en": "1 ½ cups broccoli florets"
      },
      {
        "en": "½ tsp cayenne pepper"
      },
      {
        "en": "4 large eggs"
      },
      {
        "en": "3 tbsp. low fat milk"
      },
      {
        "en": "2 cups dry quick oats"
      },
      {
        "en": "1 tbsp. olive oil"
      },
      {
        "en": "¾ tsp salt"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/636199-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 4,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "lacto ovo vegetarian"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "side dish"
      },
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "morning meal"
      },
      {
        "en": "brunch"
      },
      {
        "en": "main dish"
      },
      {
        "en": "breakfast"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "food processor"
      },
      {
        "en": "baking pan"
      },
      {
        "en": "mixing bowl"
      },
      {
        "en": "oven"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/J33PTBPD/broccoli-oatmeal-breakfast-casserole"
  },
  {
    "id": "Cr8RDQyEGwXdoiFxLCW4",
    "title": {
      "en": "Make Ahead Quiche"
    },
    "summary": {
      "en": "Make Ahead Quiche might be a good recipe to expand your main course recipe box. One portion of this dish contains approximately <b>14g of protein</b>, <b>22g of fat</b>, and a total of <b>311 calories</b>. This recipe serves 8 and costs 92 cents per serving. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. It is a <b>very budget friendly</b> recipe for fans of Mediterranean food. This recipe is liked by 2 foodies and cooks. This recipe from Foodista requires eggs, ham, salt, and pepper. With a spoonacular <b>score of 26%</b>, this dish is not so tremendous. Similar recipes are <a href=\"https://spoonacular.com/recipes/make-ahead-quiche-1372315\">Make Ahead Quiche</a>, <a href=\"https://spoonacular.com/recipes/make-ahead-tomato-croissant-quiche-183484\">Make-Ahead Tomato-Croissant Quiche</a>, and <a href=\"https://spoonacular.com/recipes/crustless-quiche-to-make-ahead-and-freeze-1226503\">Crustless Quiche to Make Ahead and Freeze</a>."
    },
    "instructions": {
      "en": "In a medium bowl, toss the flour with the grated cheese.  Evenly spread the cheese over the bottom of the pie crust.  Top the cheese with the diced ham.  In a medium bowl, whisk together eggs, half and half, salt, pepper and dry mustard.  Stir in the green onions.  Pour the egg mixture over the ham and cheese.\nCover the unbaked quiche with plastic wrap, then with foil, sealing the edges well.  Place the prepared quiche in the freezer.  When ready to bake, preheat the oven to 400 degrees.  Do not thaw the quiche! Remove the foil and plastic wrap.  Place the foil around the edges of the crust to prevent burning.  Place the frozen quiche in the oven and bake for about 1 hour, or until the filling is set and the crust is golden brown.\nTo cook the quiche immediately (without freezing first), preheat the oven to 350 degrees and bake for 45 minutes to 1 hour."
    },
    "ingredients": [
      {
        "en": "1 (9 inch) unbaked pie crust"
      },
      {
        "en": "1 cup shredded cheddar cheese"
      },
      {
        "en": "1 cup shredded Monterrey Jack cheese"
      },
      {
        "en": "1 tablespoon flour"
      },
      {
        "en": "1/2 cup cooked ham, diced"
      },
      {
        "en": "4 eggs"
      },
      {
        "en": "1 cup half and half"
      },
      {
        "en": "2 green onions, chopped"
      },
      {
        "en": "1/4 teaspoon salt"
      },
      {
        "en": "1/4 teaspoon ground dry mustard"
      },
      {
        "en": "Dash of pepper"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/650650-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 8,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "morning meal"
      },
      {
        "en": "brunch"
      },
      {
        "en": "main dish"
      },
      {
        "en": "breakfast"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [
      {
        "en": "Mediterranean"
      },
      {
        "en": "French"
      },
      {
        "en": "European"
      }
    ],
    "equipment": [
      {
        "en": "whisk"
      },
      {
        "en": "bowl"
      },
      {
        "en": "plastic wrap"
      },
      {
        "en": "aluminum foil"
      },
      {
        "en": "oven"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/SLFFTBGD/make-ahead-quiche"
  },
  {
    "id": "DzkJxyGZCv6Lvck3opqw",
    "title": {
      "en": "Palak-tofu (bean curd)"
    },
    "summary": {
      "en": "If you want to add more <b>Indian</b> recipes to your recipe box, Palak-tofu (bean curd) might be a recipe you should try. For <b>$1.07 per serving</b>, you get a side dish that serves 6. One portion of this dish contains around <b>5g of protein</b>, <b>13g of fat</b>, and a total of <b>175 calories</b>. Head to the store and pick up ginger-garlic paste, chillies, oil, and a few other things to make it today. 2 people were impressed by this recipe. It is a good option if you're following a <b>gluten free</b> diet. It is brought to you by Foodista. From preparation to the plate, this recipe takes around <b>45 minutes</b>. Overall, this recipe earns a <b>rather bad spoonacular score of 16%</b>. Similar recipes are <a href=\"https://spoonacular.com/recipes/palak-tofu-bean-curd-1357357\">Palak-tofu (bean curd)</a>, <a href=\"https://spoonacular.com/recipes/mapo-tofu-bean-curd-143648\">Mapo Tofu (Bean Curd)</a>, and <a href=\"https://spoonacular.com/recipes/mapo-tofu-bean-curd-1357343\">Mapo Tofu (Bean Curd)</a>."
    },
    "instructions": {
      "en": "<ol><li>Heat 1tbsp oil  in a pan,add the onions,saute till brown,add ginger garlic paste,saute for a min,add green chillies, chopped tomatoes and saute well.</li><li>Add the washed uncut palak,saute for 5 mins till they wilt.</li><li>Take it out in a plate and allow to cool.grind to coarse paste in a blender.set aside.</li><li>Add 1 tbsp oil in the same pan and saute the tofu cubes,add little salt,turmeric and saute for 2 mins.take them out in a plate.</li><li>Add the coarse palak paste in the pan and salt according to the content along with coriander powder.let it cook on slow for 10 mins.</li><li>Add the sauteed tofu cubes,mix well.</li><li>Crush in the kasuri methi in the palm of your hands and mix in.Pour in the milk or cream,mix well and cover it on slow flame for 5 mins.drop in the butter (it gives an added creamyness)Finish it off with garam masala.</li><li>Serve hot with roti or paratha.</li></ol>"
    },
    "ingredients": [
      {
        "en": "2 tablespoons Butter-"
      },
      {
        "en": "Coriander powder-"
      },
      {
        "en": "1/2 teaspoon cumin seeds-"
      },
      {
        "en": "Garam"
      },
      {
        "en": "1 teaspoon Ginger-garlic paste-"
      },
      {
        "en": "4 Green chillies-"
      },
      {
        "en": "1 teaspoon Kasuri methi-"
      },
      {
        "en": "1/2 cup Cream/ Milk-"
      },
      {
        "en": "2 tablespoons Oil-"
      },
      {
        "en": "1 Onions- medium cut into chunks"
      },
      {
        "en": "2 Palak- cups,washed"
      },
      {
        "en": "Salt to taste"
      },
      {
        "en": "1/2 Tofu- a block,cut into small cubes"
      },
      {
        "en": "1 Tomato- small chopped"
      },
      {
        "en": "1/2 teaspoon Turmeric-"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/654379-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 6,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "side dish"
      }
    ],
    "cuisines": [
      {
        "en": "Indian"
      },
      {
        "en": "Asian"
      }
    ],
    "equipment": [
      {
        "en": "frying pan"
      },
      {
        "en": "blender"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/BJJJDSJ6/palak-tofu-bean-curd"
  },
  {
    "id": "EK4DS2mWLpjuAtBx5opb",
    "title": {
      "en": "Peppermint Hot Chocolate Cupcakes"
    },
    "summary": {
      "en": "The recipe Peppermint Hot Chocolate Cupcakes could satisfy your American craving in approximately <b>45 minutes</b>. This recipe serves 24. This dessert has <b>349 calories</b>, <b>3g of protein</b>, and <b>13g of fat</b> per serving. For <b>59 cents per serving</b>, this recipe <b>covers 5%</b> of your daily requirements of vitamins and minerals. 42 people have tried and liked this recipe. A mixture of heavy cream, semisweet chocolate chips, vanillan extract, and a handful of other ingredients are all it takes to make this recipe so yummy. It is perfect for <b>Christmas</b>. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 21%</b>. This score is not so excellent. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/peppermint-hot-chocolate-cupcakes-587172\">Peppermint Hot Chocolate Cupcakes</a>, <a href=\"https://spoonacular.com/recipes/peppermint-hot-chocolate-cupcakes-590842\">Peppermint Hot Chocolate Cupcakes</a>, and <a href=\"https://spoonacular.com/recipes/crockpot-peppermint-hot-chocolate-peppermint-mocha-recipe-55009\">Crockpot Peppermint Hot Chocolate/peppermint Mocha Recipe</a>."
    },
    "instructions": {
      "en": "<ol><li>Preheat the oven to 350 degrees F. Line a cupcake or muffin pan with 24 regular-size cupcake liners.</li><li>Combine the chocolate chips and hot coffee together, stirring occasionally until the chocolate is melted and the mixture is smooth. In a large bowl sift together the sugar, flour, cocoa powder, baking soda, baking powder and salt. In another bowl, beat the eggs with an electric mixer until thickened slightly. Slowly add the buttermilk, oil and vanilla. Add the melted chocolate mixture to the eggs, and combine completely. Add the sugar mixture and beat on medium speed until well combined.</li><li>Fill the prepared cupcake liners three-quarters full with the cupcake batter. Place in the oven and bake until a toothpick inserted in center comes out clean, 18 to 21 minutes. Cool the cupcakes completely.</li><li>While the cupcakes are baking, prepare the Chocolate Ganache and the Peppermint Marshmallow Buttercream Frosting (directions for both below). Put the frosting into a pastry bag fitted with a star tip.</li><li>To make the Chocolate Ganache, bring the heavy cream and butter to a simmer in a small saucepan. Turn off the heat and add in the chocolate. Stir the mixture until smooth. Set aside to cool.</li><li>To make the Peppermint Marshmallow Buttercream Frosting, whip together the butter and marshmallow cream, using an electric mixer fitted with a whisk attachment. Add the peppermint extract. Slowly add 2 cups of the powdered sugar and continue to mix on a slow speed. Add the milk and additional powdered sugar, up to 2 cups, until desired consistency is reached.</li><li>To assemble cupcakes:</li><li>Using an apple corer, remove the center of each cupcake. Fill each cupcake with a spoonful of the Chocolate Ganache. Using the frosting-filled pastry bag, frost the cupcakes and sprinkle with crushed peppermint candies.</li></ol>"
    },
    "ingredients": [
      {
        "en": "1/2 teaspoon baking powder"
      },
      {
        "en": "1 1/3 teaspoon baking soda"
      },
      {
        "en": "1 cup hot-brewed coffee"
      },
      {
        "en": "1/2 cup butter, softened"
      },
      {
        "en": "1 cup buttermilk"
      },
      {
        "en": "2 eggs"
      },
      {
        "en": "1 2/3 cups all-purpose flour"
      },
      {
        "en": "1/2 cup heavy cream"
      },
      {
        "en": "7 ounces marshmallow creme"
      },
      {
        "en": "2 tablespoons milk"
      },
      {
        "en": "1/4 cup crushed peppermint candies"
      },
      {
        "en": "1 teaspoon peppermint extract"
      },
      {
        "en": "4 cups powdered sugar"
      },
      {
        "en": "1 teaspoon salt"
      },
      {
        "en": "6 ounces semisweet chocolate"
      },
      {
        "en": "2 ounces mini semisweet chocolate chips"
      },
      {
        "en": "2 cups sugar"
      },
      {
        "en": "1/2 tablespoon unsalted butter"
      },
      {
        "en": "1 cup unsweetened cocoa powder"
      },
      {
        "en": "1/2 teaspoon vanilla extract"
      },
      {
        "en": "1/2 cup vegetable oil"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/631755-556x370.",
    "readyInMinutes": 45,
    "servings": 24,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "dessert"
      }
    ],
    "cuisines": [
      {
        "en": "American"
      }
    ],
    "equipment": [
      {
        "en": "muffin liners"
      },
      {
        "en": "muffin tray"
      },
      {
        "en": "oven"
      },
      {
        "en": "hand mixer"
      },
      {
        "en": "bowl"
      },
      {
        "en": "toothpicks"
      },
      {
        "en": "pastry bag"
      },
      {
        "en": "sauce pan"
      },
      {
        "en": "whisk"
      },
      {
        "en": "apple corer"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/QHL47KFG/peppermint-hot-chocolate-cupcakes"
  },
  {
    "id": "G1v0B63sbaQVcj8hr6o0",
    "title": {
      "en": "Enchilada Stuffed Spaghetti Squash"
    },
    "summary": {
      "en": "Enchilada Stuffed Spaghetti Squash requires roughly <b>1 hour</b> from start to finish. One portion of this dish contains roughly <b>54g of protein</b>, <b>31g of fat</b>, and a total of <b>754 calories</b>. This recipe serves 4 and costs $4.54 per serving. If you have corn, rotisserie chicken, cilantro, and a few other ingredients on hand, you can make it. It works well as a Mexican main course. 2 people have tried and liked this recipe. It is a good option if you're following a <b>gluten free</b> diet. It is brought to you by Foodista. Taking all factors into account, this recipe <b>earns a spoonacular score of 75%</b>, which is solid. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/enchilada-stuffed-spaghetti-squash-1371409\">Enchilada Stuffed Spaghetti Squash</a>, <a href=\"https://spoonacular.com/recipes/enchilada-stuffed-spaghetti-squash-1340461\">Enchilada Stuffed Spaghetti Squash</a>, and <a href=\"https://spoonacular.com/recipes/chicken-enchilada-stuffed-spaghetti-squash-247478\">Chicken Enchilada Stuffed Spaghetti Squash</a>."
    },
    "instructions": {
      "en": "<ol><li>If you don't have have your chicken already prepared or have leftovers, cook the chicken breasts and shred or dice.</li><li>Meanwhile, cook the spaghetti squash. Two methods to cook the squash: #1- Microwave by placing squash in a baking dish, cut size down and fill the dish with an inch of water. Microwave on high for about 8-12 minutes (rotating a few times) or until the outside is soft enough to be pierced with a fork. #2- Brush inner flesh with oil, season with salt and pepper and roast in a 400 F oven, cut side up in a baking dish until tender, about 30-40 min.</li><li>Mix together the chicken, enchilada sauce, beans, corn, olives, cilantro and cheese (save some of the cheese for topping).</li><li>Scrape the sides of the spaghetti squash so the \"noodles\" are tossed and more loose.</li><li>Divide the enchilada mixture between the squash boats and top with the extra cheese you saved.</li><li>Broil in the oven until the cheese is melted and golden brown, about 2-3 minutes. Garnish with cilantro and top with avocado slices (if using).</li></ol>"
    },
    "ingredients": [
      {
        "en": "2 avocados"
      },
      {
        "en": "1/3 cup black olives"
      },
      {
        "en": "15 oz can low-sodium black beans"
      },
      {
        "en": "1/2 cup corn"
      },
      {
        "en": "16 oz enchilada sauce"
      },
      {
        "en": "1/4 cup fresh cilantro"
      },
      {
        "en": "1 cup shredded reduced fat cheddar cheese"
      },
      {
        "en": "2 cups cooked rotisserie chicken"
      },
      {
        "en": "2 small spaghetti squash"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/642395-556x370.jpg",
    "readyInMinutes": 60,
    "servings": 4,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "side dish"
      },
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [
      {
        "en": "Mexican"
      }
    ],
    "equipment": [
      {
        "en": "baking pan"
      },
      {
        "en": "microwave"
      },
      {
        "en": "oven"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/C7DJP46H/enchilada-stuffed-spaghetti-squash"
  },
  {
    "id": "HFBuHreB9kHjfDf9UKpp",
    "title": {
      "en": "Brown sugar & Spice Sugar cookie frogs"
    },
    "summary": {
      "en": "Brown sugar & Spice Sugar cookie frogs takes roughly <b>45 minutes</b> from beginning to end. This recipe serves 30 and costs 12 cents per serving. This dessert has <b>129 calories</b>, <b>2g of protein</b>, and <b>6g of fat</b> per serving. 28 people have tried and liked this recipe. Head to the store and pick up unbleached, allspice, egg, and a few other things to make it today. It can be enjoyed any time, but it is especially good for <b>Christmas</b>. It is a good option if you're following a <b>lacto ovo vegetarian</b> diet. It is brought to you by Foodista. Overall, this recipe earns a <b>not so great spoonacular score of 10%</b>. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/brown-sugar-cinnamon-sugar-cookie-bars-249420\">Brown Sugar Cinnamon Sugar Cookie Bars</a>, <a href=\"https://spoonacular.com/recipes/rolling-stones-brown-sugar-cupcake-with-coconut-custard-filling-spiced-rum-frosting-and-cracked-brown-sugar-brittle-354217\">Rolling Stones Brown Sugar Cupcake with Coconut Custard Filling, Spiced Rum Frosting and Cracked Brown Sugar Brittle</a>, and <a href=\"https://spoonacular.com/recipes/brown-sugar-pound-cakes-with-brown-sugar-cream-cheese-frosting-538490\">Brown Sugar Pound Cakes with Brown Sugar Cream Cheese Frosting</a>."
    },
    "instructions": {
      "en": "Whisk the flour, baking powder and spices, set aside.\nCream the sugar and butter. Add the egg and extracts and mix until well-blended.\nGradually add the flour mixture and beat just until combined, scraping down the bowl, especially the bottom. (The dough will be quite thick...you may need to knead in stray bits of flour from the bottom of the bowl by hand.)\nRoll on a floured surface and cut into shapes. Place on parchment lined baking sheets and bake for 9-12 minutes, depending on the size of your cutter. Let sit a few minutes on the sheet, then transfer to a cooling rack."
    },
    "ingredients": [
      {
        "en": "3 c unbleached, all-purpose flour"
      },
      {
        "en": "2 tsp baking powder"
      },
      {
        "en": "1/2 tsp cinnamon"
      },
      {
        "en": "1/4 tsp ginger"
      },
      {
        "en": "1/8 tsp nutmeg (freshly grated, if possible)"
      },
      {
        "en": "1/8 tsp allspice"
      },
      {
        "en": "1/2 c granulated sugar (I use sugar that I've stored vanilla beans in)"
      },
      {
        "en": "1/2 c light brown sugar (packed)"
      },
      {
        "en": "2 sticks butter"
      },
      {
        "en": "1 egg"
      },
      {
        "en": "1 tsp pure vanilla extract"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/636300-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 30,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "lacto ovo vegetarian"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "dessert"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "whisk"
      },
      {
        "en": "bowl"
      },
      {
        "en": "baking sheet"
      },
      {
        "en": "oven"
      },
      {
        "en": "wire rack"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/883DLCS5/brown-sugar-spice-sugar-cookie-frogs"
  },
  {
    "id": "Hw6Py5Pj1kj5t6x4JZya",
    "title": {
      "en": "Green Thai Curry with Beef"
    },
    "summary": {
      "en": "Green Thai Curry with Beef might be a good recipe to expand your main course recipe box. For <b>$5.87 per serving</b>, this recipe <b>covers 42%</b> of your daily requirements of vitamins and minerals. This recipe serves 4. Watching your figure? This gluten free and dairy free recipe has <b>659 calories</b>, <b>39g of protein</b>, and <b>46g of fat</b> per serving. If you have soy sauce, oil, flank steak, and a few other ingredients on hand, you can make it. It is an <b>expensive</b> recipe for fans of Asian food. 2 people have tried and liked this recipe. It is brought to you by Foodista. From preparation to the plate, this recipe takes around <b>3 hours</b>. With a spoonacular <b>score of 78%</b>, this dish is good. Similar recipes are <a href=\"https://spoonacular.com/recipes/thai-red-beef-curry-with-green-beans-1366063\">Thai Red Beef Curry with Green Beans</a>, <a href=\"https://spoonacular.com/recipes/thai-red-beef-curry-with-green-beans-838836\">Thai Red Beef Curry with Green Beans</a>, and <a href=\"https://spoonacular.com/recipes/homemade-thai-green-curry-paste-and-an-easy-thai-green-curry-909057\">Homemade Thai Green Curry Paste (And An Easy Thai Green Curry)</a>."
    },
    "instructions": {
      "en": "<ol><li>Prepare marinade.</li><li>Slice beef. Add beef and marinade to freezer bag. Marinate for 2-4 in the fridge. The longer the better.</li><li>Slice/chop all your veggies.</li><li>Prepare your curry paste.</li><li>Add oil to wok and heat.</li><li>Cook beef until done, approximately 10 minutes.</li><li>Remove from wok and set aside.</li><li>Add onions and cook for about 2 minutes.</li><li>Add carrots, peppers and mushrooms.</li><li>When almost done (to your preferred tenderness) add snap peas and bok choy. Cook about 2 minutes.</li><li>Remove veggies from wok and set aside.</li><li>Add curry paste to wok and heat through.</li><li>Add coconut milk and whisk until smooth.</li><li>Bring to a boil.</li><li>Add beef to the sauce.</li><li>Add veggies to the beef/sauce mixture.</li><li>Heat through.</li><li>Serve over your choice of noodles or riice.</li></ol>"
    },
    "ingredients": [
      {
        "en": "4 oz baby bok choy (trimmed)"
      },
      {
        "en": "1 can coconut milk"
      },
      {
        "en": "2 large carrots (thinly sliced diagonal)"
      },
      {
        "en": "2 tbsp. green curry powder"
      },
      {
        "en": "2 tbsp. fish sauce"
      },
      {
        "en": "20 oz. flank steak"
      },
      {
        "en": "2 cloves of garlic (thinly sliced)"
      },
      {
        "en": "1 tbsp. lemon juice"
      },
      {
        "en": "1/2 tsp. ground lemongrass"
      },
      {
        "en": "Oil for cooking in wok"
      },
      {
        "en": "1 large onions (sliced)"
      },
      {
        "en": "1 orange pepper (thinly sliced)"
      },
      {
        "en": "7oz. oyster mushrooms (chopped)"
      },
      {
        "en": "1 red pepper (thinly sliced)"
      },
      {
        "en": "1 tbsp. rice wine vinegar"
      },
      {
        "en": "4 oz. snap peas (thinly sliced diagonal)"
      },
      {
        "en": "3 tbsp. soy sauce"
      },
      {
        "en": "1 yellow pepper (thinly sliced)"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/645541-556x370.jpg",
    "readyInMinutes": 180,
    "servings": 4,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [
      {
        "en": "Thai"
      },
      {
        "en": "Asian"
      }
    ],
    "equipment": [
      {
        "en": "wok"
      },
      {
        "en": "whisk"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/XLCRNHRG/green-thai-curry-with-beef"
  },
  {
    "id": "LvVDQCUPKRBYj4QLPFHQ",
    "title": {
      "en": "Tasty Easy Meatloaf"
    },
    "summary": {
      "en": "Tasty Easy Meatloaf is a <b>dairy free</b> main course. This recipe serves 8 and costs $1.17 per serving. One portion of this dish contains roughly <b>18g of protein</b>, <b>20g of fat</b>, and a total of <b>334 calories</b>. Not a lot of people made this recipe, and 2 would say it hit the spot. This recipe from Foodista requires salt, worcestershire, pepper, and grain mustard. From preparation to the plate, this recipe takes around <b>45 minutes</b>. Overall, this recipe earns a <b>rather bad spoonacular score of 38%</b>. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/easy-tasty-fish-tomatoes-111655\">Easy & Tasty Fish & Tomatoes</a>, <a href=\"https://spoonacular.com/recipes/easy-and-tasty-baked-ziti-138765\">Easy and Tasty Baked Ziti</a>, and <a href=\"https://spoonacular.com/recipes/easy-and-tasty-pizza-sauce-546686\">Easy and Tasty Pizza Sauce</a>."
    },
    "instructions": {
      "en": "<ol><li>Mix beef, sausage, bread crumbs, onion, egg, salt, pepper, cumin, garlic powder,  cup tomato sauce. Do not over mix or your meatloaf will become chewy. Simply use your fingers and mush it together and only do this until it is just mixed.</li><li>Place in a shallow oven proof pan and form into a loaf. Stir together the remaining sauce, vinegar, sugar, mustard, water and Worcestershire</li><li>Pour the sauce over the meatloaf and bake x 1 hour until cooked through. While cooking, spoon the sauce over the top of the meatloaf about every 20 minutes.</li><li>Remove from the oven and spoon the sauce over the top a final time. Allow to rest for 10 minutes before serving.</li></ol>"
    },
    "ingredients": [
      {
        "en": "1 cup breadcrumbs"
      },
      {
        "en": "3 Tbs brown sugar – packed"
      },
      {
        "en": "½ lb bulk sausage"
      },
      {
        "en": "2 8 oz cans tomato sauce - divided"
      },
      {
        "en": "3 Tbs Cider vinegar"
      },
      {
        "en": "½ tsp cumin"
      },
      {
        "en": "1 egg beaten"
      },
      {
        "en": "1 tsp garlic powder"
      },
      {
        "en": "1 lb Ground Beef"
      },
      {
        "en": "1 small onion – diced."
      },
      {
        "en": "½ tsp pepper"
      },
      {
        "en": "1 ½ tsp salt"
      },
      {
        "en": "½ cup water"
      },
      {
        "en": "2 Tbs good quality whole grain mustard"
      },
      {
        "en": "2 Tbs Worcestershire"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/662917-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 8,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "dairy free"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "oven"
      },
      {
        "en": "frying pan"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/RFC3GL4B/tasty-easy-meatloaf"
  },
  {
    "id": "MEpmzYb4m3mtN46Gkdk6",
    "title": {
      "en": "Peanut Butter Sriracha Cookies"
    },
    "summary": {
      "en": "Peanut Butter Sriracha Cookies is a <b>lacto ovo vegetarian</b> dessert. This recipe serves 60. One portion of this dish contains about <b>3g of protein</b>, <b>8g of fat</b>, and a total of <b>180 calories</b>. For <b>16 cents per serving</b>, this recipe <b>covers 3%</b> of your daily requirements of vitamins and minerals. 115 people were glad they tried this recipe. A mixture of flour, crunchy peanut butter, eggs, and a handful of other ingredients are all it takes to make this recipe so flavorful. From preparation to the plate, this recipe takes around <b>45 minutes</b>. It is brought to you by Foodista. With a spoonacular <b>score of 15%</b>, this dish is rather bad. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/healthy-peanut-butter-surprise-cookies-fudgy-brownie-cookies-with-a-peanut-butter-center-1400161\">Healthy Peanut Butter Surprise Cookies (Fudgy Brownie Cookies with a Peanut Butter Center!)</a>, <a href=\"https://spoonacular.com/recipes/healthy-peanut-butter-surprise-cookies-fudgy-brownie-cookies-with-a-peanut-butter-center-523094\">Healthy Peanut Butter Surprise Cookies (Fudgy Brownie Cookies with a Peanut Butter Center!)</a>, and <a href=\"https://spoonacular.com/recipes/peanut-butter-sriracha-popcorn-balls-617080\">Peanut Butter-Sriracha Popcorn Balls</a>."
    },
    "instructions": {
      "en": "Cream together butter, peanut butter and sugars.\nSlowly add in sriracha, eggs and vanilla. Beat until combined.\nIn another bowl mix together flour, baking powder, baking soda and salt.\nGently mix flour into peanut butter mixture until well combined. Place batter into refrigerator for 1 hour to chill.\nPre-heat oven to 375 degrees.\nRoll dough into approx 1 sized balls or use a Medium sized cookie scoop/Size 40  1tbs portion. Dip the top of dough ball into granulated sugar and place onto cookie sheet.\nFlatten each ball with a fork, making a criss-cross pattern. Bake for 8-10 minutes or just until the cookies begin to brown. Do NOT over-bake!\nCool on wire racks and enjoy!"
    },
    "ingredients": [
      {
        "en": "1 cup Unsalted Butter (softened)"
      },
      {
        "en": "1½ cups Crunchy Peanut Butter (or Sunbutter if allergic to peanuts)"
      },
      {
        "en": "1 cup Sugar"
      },
      {
        "en": "1 cup Brown Sugar (packed)"
      },
      {
        "en": "¼ c Sriracha"
      },
      {
        "en": "2 Eggs"
      },
      {
        "en": "1 tsp Vanilla extract"
      },
      {
        "en": "2¾ to 3 cups All-Purpose Flour (finished dough should be soft, but not sticky)"
      },
      {
        "en": "1 teaspoon Baking Powder"
      },
      {
        "en": "½ teaspoon Salt"
      },
      {
        "en": "1½ teaspoons baking soda"
      },
      {
        "en": "Granulated sugar for dipping dough balls into."
      },
      {
        "en": "Optional: 1-2 cups Chocolate Chips to add to dough. OR Add a Hershey's Chocolate Kiss on top as done for Peanut Butter Blossoms. Doesn't change baking time."
      }
    ],
    "image": "https://img.spoonacular.com/recipes/655335-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 60,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "lacto ovo vegetarian"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "dessert"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "bowl"
      },
      {
        "en": "oven"
      },
      {
        "en": "baking sheet"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/YGQH8YZV/peanut-butter-sriracha-cookies"
  },
  {
    "id": "MdLOjJ8yMIDuvcVxhLxr",
    "title": {
      "en": "Dried Cherry-Almond Scones"
    },
    "summary": {
      "en": "Dried Cherry-Almond Scones could be just the <b>lacto ovo vegetarian</b> recipe you've been looking for. This breakfast has <b>217 calories</b>, <b>6g of protein</b>, and <b>7g of fat</b> per serving. This recipe serves 16 and costs 50 cents per serving. 2 people have tried and liked this recipe. Head to the store and pick up salt, buttermik, eggs, and a few other things to make it today. Not a lot of people really liked this European dish. It is brought to you by Foodista. From preparation to the plate, this recipe takes about <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 29%</b>. This score is rather bad. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/dried-cherry-almond-scones-309746\">Dried Cherry Almond Scones</a>, <a href=\"https://spoonacular.com/recipes/dried-cherry-scones-124190\">Dried Cherry Scones</a>, and <a href=\"https://spoonacular.com/recipes/dried-cherry-lemon-scones-175781\">Dried Cherry-Lemon Scones</a>."
    },
    "instructions": {
      "en": "<ol><li>Preheat oven to 400 degree F.  Stir together flour, 1/4 cup sugar, and next 3 ingredients in a large bowl; cut int butter with a pastry blender or fork until crumbly.  Stir in cherries and almonds.</li><li>Whisk together buttermilk, 1 egg, and almond extract; add to flour mixture, stirring with a fork just until dry ingredients are moistened and mixture forms a shaggy dough.</li><li>Use floured hands to pat dough into a 1/2-inch thick, 10-x7-inch rectangle on a lightly floured surface; cut into 16 rectangles.  Place scone dough on a parchment paper-lined baking sheet.  Whisk together remaining egg and 1 teaspoon water.  Brush scones with egg wash; sprinkle with remaining 1/4 cup sugar.</li><li>Bake in preheated oven for 12 to 15 minutes or until golden.</li></ol>"
    },
    "ingredients": [
      {
        "en": "1/2 teaspoon almond extract"
      },
      {
        "en": "1/2 cup chopped toasted almonds"
      },
      {
        "en": "1 tablespoon baking powder"
      },
      {
        "en": "1/2 teaspoon baking soda"
      },
      {
        "en": "1 cup dried cherries"
      },
      {
        "en": "2 large eggs"
      },
      {
        "en": "500g Plain flour, sifted"
      },
      {
        "en": "1/2 tsp Salt"
      },
      {
        "en": "2 tbsp Sugar"
      },
      {
        "en": "6 tablespoons unsalted butter, cut into pieces"
      },
      {
        "en": "2/3 cup buttermik"
      },
      {
        "en": "2/3 cup buttermik"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/641650-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 16,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "lacto ovo vegetarian"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "morning meal"
      },
      {
        "en": "dessert"
      },
      {
        "en": "brunch"
      },
      {
        "en": "breakfast"
      }
    ],
    "cuisines": [
      {
        "en": "English"
      },
      {
        "en": "Scottish"
      },
      {
        "en": "British"
      },
      {
        "en": "European"
      }
    ],
    "equipment": [
      {
        "en": "blender"
      },
      {
        "en": "bowl"
      },
      {
        "en": "oven"
      },
      {
        "en": "whisk"
      },
      {
        "en": "baking paper"
      },
      {
        "en": "baking sheet"
      }
    ],
    "sourceUrl": "http://www.foodista.com/recipe/5434SY2K/dried-cherry-almond-scones"
  },
  {
    "id": "NTkbWN8Qp4SzFkONINvR",
    "title": {
      "en": "Baked Oatmeal with Dried Cranberries"
    },
    "summary": {
      "en": "Baked Oatmeal with Dried Cranberries might be just the breakfast you are searching for. One portion of this dish contains approximately <b>5g of protein</b>, <b>4g of fat</b>, and a total of <b>194 calories</b>. This recipe serves 9. For <b>51 cents per serving</b>, this recipe <b>covers 9%</b> of your daily requirements of vitamins and minerals. 11 person found this recipe to be scrumptious and satisfying. It is a good option if you're following a <b>gluten free and dairy free</b> diet. It is perfect for <b>Christmas</b>. It is brought to you by Foodista. If you have flaxseeds, baking powder, oats, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 53%</b>, which is good. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/baked-oatmeal-with-dried-cranberries-apricots-48700\">Baked Oatmeal with Dried Cranberries & Apricots</a>, <a href=\"https://spoonacular.com/recipes/overnight-oatmeal-with-almonds-and-dried-cranberries-55705\">Overnight Oatmeal With Almonds And Dried Cranberries</a>, and <a href=\"https://spoonacular.com/recipes/overnight-oatmeal-with-almonds-and-dried-cranberries-55826\">Overnight Oatmeal with Almonds and Dried Cranberries</a>."
    },
    "instructions": {
      "en": "<ol><li>1.Preheat oven to 350F</li><li>2.Mix dry ingredients until well combined.</li><li>3. Mix liquid ingredients separately.</li><li>4.Add the liquid ingredients to the dry mix.</li><li>5.Mix well.</li><li>5.Spray a pan with a non-stick spray - the smaller the pan, the thicker the bars will be.</li><li>6.Pour the mix into the pan.</li><li>7.Bake for 45 minutes.</li><li>8.Enjoy!</li></ol>"
    },
    "ingredients": [
      {
        "en": "1 cup almond milk (I used original unsweetened)"
      },
      {
        "en": "2 tsp baking powder"
      },
      {
        "en": "2 very ripe bananas, mashed"
      },
      {
        "en": "1 1/2 tsp cinnamon"
      },
      {
        "en": "1 cup dried cranberries"
      },
      {
        "en": "2 eggs"
      },
      {
        "en": "1 tbsp flaxseeds"
      },
      {
        "en": "3 cups dry oats (I used old fashioned oats)"
      },
      {
        "en": "1/4 teaspoon Salt"
      },
      {
        "en": "1 tsp vanilla extract"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/633692-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 9,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "morning meal"
      },
      {
        "en": "brunch"
      },
      {
        "en": "breakfast"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "oven"
      },
      {
        "en": "frying pan"
      }
    ],
    "sourceUrl": "http://www.foodista.com/recipe/VS5TY2X2/baked-oatmeal-with-dried-cranberries"
  },
  {
    "id": "NxW9WXRsK7TM1ZCe2RUZ",
    "title": {
      "en": "Torta (Filipino Omelet)"
    },
    "summary": {
      "en": "Torta (Filipino Omelet) takes roughly <b>45 minutes</b> from beginning to end. This recipe serves 8 and costs 53 cents per serving. One portion of this dish contains about <b>7g of protein</b>, <b>10g of fat</b>, and a total of <b>174 calories</b>. 3 people were impressed by this recipe. This recipe from Foodista requires vegetable oil, garlic cloves, onion, and cilantro. It is a good option if you're following a <b>gluten free, dairy free, and lacto ovo vegetarian</b> diet. It works well as a hor d'oeuvre. Taking all factors into account, this recipe <b>earns a spoonacular score of 33%</b>, which is not so awesome. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/torta-filipino-omelet-1432501\">Torta (Filipino Omelet)</a>, <a href=\"https://spoonacular.com/recipes/torta-filipino-omelet-1501675\">Torta (Filipino Omelet)</a>, and <a href=\"https://spoonacular.com/recipes/filipino-torta-meets-italian-frittata-568492\">Filipino Torta Meets Italian Frittata</a>."
    },
    "instructions": {
      "en": "In a medium-heated large skillet, add a little oil and thoroughly cook the meat and potatoes along with soy sauce, garlic and onions. Set aside to cool.\nMeanwhile, in a mixing bowl, combine cooled meat mixture with the eggs, tomatoes, cilantro and scallions. Season with salt & pepper and whisk until evenly incorporated.\nIn the same skillet in medium heat, ladle just enough to form a thin pancake-size patty, one batch at a time. Cook both sides, flipping over after 2-3 minutes. Be careful not to over brown the eggs. Transfer to a plate, cut in wedges (for bite-size servings) and garnish with cilantro leaves, if you want."
    },
    "ingredients": [
      {
        "en": "1 pound Ground Beef, low fat (or Pork, Turkey, 1 Russet Potato, diced"
      },
      {
        "en": "4 Garlic Cloves, minced"
      },
      {
        "en": "1 Onion, finely diced"
      },
      {
        "en": "1 can Diced Tomatoes, liquid drained"
      },
      {
        "en": "6 Large Eggs"
      },
      {
        "en": "1 Bunch Scallions, finely chopped"
      },
      {
        "en": "1/4 cup Chopped Cilantro (optional)"
      },
      {
        "en": "4 tablespoons vegetable Oil"
      },
      {
        "en": "4 tablespoons Low-Sodium Soy Sauce"
      },
      {
        "en": "Salt & Pepper"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/663680-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 8,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      },
      {
        "en": "lacto ovo vegetarian"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "antipasti"
      },
      {
        "en": "starter"
      },
      {
        "en": "morning meal"
      },
      {
        "en": "snack"
      },
      {
        "en": "brunch"
      },
      {
        "en": "appetizer"
      },
      {
        "en": "antipasto"
      },
      {
        "en": "breakfast"
      },
      {
        "en": "hor d'oeuvre"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "frying pan"
      },
      {
        "en": "mixing bowl"
      },
      {
        "en": "whisk"
      },
      {
        "en": "ladle"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/DFP52247/torta-filipino-omelet"
  },
  {
    "id": "Q3I4seW2h19jLMmyxy8H",
    "title": {
      "en": "Barbecued Pulled Beef Sandwiches"
    },
    "summary": {
      "en": "Barbecued Pulled Beef Sandwiches requires about <b>45 minutes</b> from start to finish. For <b>$2.71 per serving</b>, this recipe <b>covers 26%</b> of your daily requirements of vitamins and minerals. This recipe serves 6. Watching your figure? This dairy free recipe has <b>766 calories</b>, <b>37g of protein</b>, and <b>33g of fat</b> per serving. 5 people were glad they tried this recipe. It works well as a rather inexpensive main course. Head to the store and pick up bacon, hawaiian rolls, olive oil, and a few other things to make it today. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 53%</b>. This score is pretty good. <a href=\"https://spoonacular.com/recipes/barbecued-beef-sandwiches-425271\">Barbecued Beef Sandwiches</a>, <a href=\"https://spoonacular.com/recipes/barbecued-beef-sandwiches-425278\">Barbecued Beef Sandwiches</a>, and <a href=\"https://spoonacular.com/recipes/barbecued-beef-sandwiches-425289\">Barbecued Beef Sandwiches</a> are very similar to this recipe."
    },
    "instructions": {
      "en": "Preheat oven to 350 degrees. Line a rimmed cookie sheet with parchment paper. Lay bacon strips over parchment. Bake pan for 10-15 minutes, or until bacon is crispy. Remove from oven and let cool on pan. Reduce oven heat to 250 degrees and leave oven door open while you dress the beef.\nDrizzle olive oil over the bottom of a medium roasting pan. Place meat in roasting pan, and coast with sugar (you want kind of a thin crust). Season generously with salt and pepper and cover with onions. Tent pan with aluminum foil.\nRoast meat for 3 to 4-1/2 hours, or until beef is fork tender and can be pulled apart easily. Remove from oven, and set aside to cool slightly. Meanwhile, chop bacon into small-dice bits.\nWhen meat can be handled, shred apart and add barbecue sauce and bacon. Mix until evenly coated and bacon is distributed. Season with salt and pepper to taste, and add more barbecue sauce if you will. Serve hot on toasted buns or Hawaiian rolls."
    },
    "ingredients": [
      {
        "en": "6 strips bacon"
      },
      {
        "en": "2 pounds beef chuck"
      },
      {
        "en": "2 tablespoons olive oil"
      },
      {
        "en": "1/2 cup brown sugar"
      },
      {
        "en": "salt and pepper"
      },
      {
        "en": "1 onion, chopped"
      },
      {
        "en": "2 cups to 3 of barbecue sauce"
      },
      {
        "en": "Hamburger buns or Hawaiian rolls"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/634320-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 6,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "dairy free"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "baking paper"
      },
      {
        "en": "baking sheet"
      },
      {
        "en": "oven"
      },
      {
        "en": "frying pan"
      },
      {
        "en": "roasting pan"
      },
      {
        "en": "aluminum foil"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/6PZJ82YX/barbecued-pulled-beef-sandwiches"
  },
  {
    "id": "WTqDXgP9CHeJmW0uFrTl",
    "title": {
      "en": "Khachapuri"
    },
    "summary": {
      "en": "Khachapuri is a <b>lacto ovo vegetarian</b> main course. One serving contains <b>686 calories</b>, <b>37g of protein</b>, and <b>55g of fat</b>. This recipe serves 8 and costs $2.4 per serving. This recipe from Foodista has 2 fans. From preparation to the plate, this recipe takes about <b>45 minutes</b>. A mixture of twist and ends together to make a rough knob. cover, parsley, swiss cheese 8 ounces cheddar 2 eggs, and a handful of other ingredients are all it takes to make this recipe so yummy. Taking all factors into account, this recipe <b>earns a spoonacular score of 49%</b>, which is good. Try <a href=\"https://spoonacular.com/recipes/khachapuri-446570\">Khachapuri</a>, <a href=\"https://spoonacular.com/recipes/buffalo-chicken-khachapuri-865645\">Buffalo Chicken Khachapuri</a>, and <a href=\"https://spoonacular.com/recipes/khachapuri-is-a-georgian-cheese-bread-572881\">Khachapuri Is a Georgian Cheese Bread</a> for similar recipes."
    },
    "instructions": {
      "en": "Dissolve yeast and 1 tsp sugar in 1/4 cup water and let stand 5-10 minutes to proof until foamy. Add milk, 2 tbs sugar, butter, salt, and enough flour to make a soft dough. Place in greased bowl and turn to coat all sides. cover and let rise until double in bulk. shred cheeses, combine all filling ingredients and refrigerate. grease a 9\" springform pan very well. punch down dough, shape into a ball, and roll to a 20\" circle. Ease dough into pan (fold in half to lift and unfold in pan) letting excess hang over the edge. mound cheese filling onto dough in pan and bring dough up over the filling, folding to make 8-12 evenly-spaced pleats.\nTwist and pinch ends together to make a rough knob. Cover with a buttered 12\" square of waxed paper and let rise until double in bulk. Brush loaf with glaze of 1 egg white + 1 tbs water (or use margarine).\nBake 40-50 min. @ 375 or until deep golden brown. Remove bread from pan, place directly on oven rack, and bake for an additional 5 minutes to brown bottom crust. Cool on rack for 45 minutes before cutting into wedges."
    },
    "ingredients": [
      {
        "en": "1 package dry yeast"
      },
      {
        "en": "1 teaspoon sugar"
      },
      {
        "en": "1/4 cup water, warm (110 degrees)"
      },
      {
        "en": "3/4 cup milk, room temp."
      },
      {
        "en": "2 tablespoons sugar"
      },
      {
        "en": "1/2 cup butter, melted"
      },
      {
        "en": "1 teaspoon salt"
      },
      {
        "en": "3 1/2 cups flour (all-purpose or bread 8 ounces muenster cheese 8 ounces Jarlsberg or Swiss cheese 8 ounces white cheddar 2 eggs, beaten slightly 2 tablespoons parsley, chopped 1/4 teaspoon pepper, white"
      },
      {
        "en": "8 ounces muenster cheese"
      },
      {
        "en": "8 ounces Jarlsberg or Swiss cheese"
      },
      {
        "en": "8 ounces white cheddar"
      },
      {
        "en": "2 eggs, beaten slightly"
      },
      {
        "en": "2 tablespoons parsley, chopped"
      },
      {
        "en": "1/4 teaspoon pepper, white"
      },
      {
        "en": "1Dissolve yeast and 1 tsp sugar in 1/4 cup water and let stand 5-10 minutes to proof until foamy. Add milk, 2 Tbs sugar, butter, salt, and enough flour to make a soft dough. Place in greased bowl and turn to coat all sides. cover and let rise until double"
      },
      {
        "en": "2Twist and pinch ends together to make a rough knob. Cover with a buttered 12\" square of waxed paper and let rise until double in bulk. Brush loaf with glaze of 1 egg white + 1 Tbs water (or use margarine)."
      },
      {
        "en": "3Bake 40-50 min. @ 375 or until deep golden brown. Remove bread from pan, place directly on oven rack, and bake for an additional 5 minutes to brown bottom crust. Cool on rack for 45 minutes before cutting into wedges."
      }
    ],
    "image": "https://img.spoonacular.com/recipes/648852-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 8,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "lacto ovo vegetarian"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "springform pan"
      },
      {
        "en": "bowl"
      },
      {
        "en": "oven"
      },
      {
        "en": "frying pan"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/6KTLX5JQ/khachapuri"
  },
  {
    "id": "XEAsSG8Hj7oJ8LBAAuj6",
    "title": {
      "en": "Ginger Beef Stir Fry"
    },
    "summary": {
      "en": "Ginger Beef Stir Fry might be just the main course you are searching for. One portion of this dish contains roughly <b>32g of protein</b>, <b>12g of fat</b>, and a total of <b>416 calories</b>. This recipe serves 4. For <b>$3.77 per serving</b>, this recipe <b>covers 34%</b> of your daily requirements of vitamins and minerals. It is a good option if you're following a <b>gluten free and dairy free</b> diet. 3 people have tried and liked this recipe. It is brought to you by Foodista. From preparation to the plate, this recipe takes about <b>45 minutes</b>. If you have water chestnuts, bell pepper, top sirloin steak, and a few other ingredients on hand, you can make it. All things considered, we decided this recipe <b>deserves a spoonacular score of 87%</b>. This score is awesome. Try <a href=\"https://spoonacular.com/recipes/ginger-beef-stir-fry-110609\">Ginger Beef Stir-Fry</a>, <a href=\"https://spoonacular.com/recipes/ginger-beef-stir-fry-1343433\">Ginger Beef Stir Fry</a>, and <a href=\"https://spoonacular.com/recipes/ginger-beef-stir-fry-1523023\">Ginger Beef Stir Fry</a> for similar recipes."
    },
    "instructions": {
      "en": "<ol><li>Thinly slice sirloin against grain in 1 inch wide strips. Cut each water chestnut in half. In a large skillet or wok, quickly brown sirloin in hot oil. Stir in chestnuts, carrots, onion, garlic and ginger until onion is soft. Stir in pepper and lettuce for one minute. Stir in marmalade and soy sauce. Cook, stirring about 2 minutes. Serve at once.</li><li>Makes 4 servings.</li></ol>"
    },
    "ingredients": [
      {
        "en": "1 can (8 oz.) water chestnuts, drained"
      },
      {
        "en": "3 mediums Carrots, cut in 2 inch sticks"
      },
      {
        "en": "6 ounces Fresh ginger root"
      },
      {
        "en": "4 cloves garlic"
      },
      {
        "en": "1 large Green bell pepper, chunked"
      },
      {
        "en": "1 quart Salad lettuce"
      },
      {
        "en": "1 medium Onion, sliced"
      },
      {
        "en": "1/4 cup Orange marmalade"
      },
      {
        "en": "1/4 cup plus 1 tablespoon soy sauce"
      },
      {
        "en": "1 pound Top sirloin steak"
      },
      {
        "en": "2 tablespoons Vegetable oil"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/644554-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 4,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "frying pan"
      },
      {
        "en": "wok"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/F7LXNN6G/ginger-beef-stir-fry"
  },
  {
    "id": "aOEt1HY9taVVSQX7gAOt",
    "title": {
      "en": "Shrimp and Avocado Salad"
    },
    "summary": {
      "en": "Need a <b>gluten free, dairy free, and pescatarian main course</b>? Shrimp and Avocado Salad could be an awesome recipe to try. This recipe serves 4 and costs $11.57 per serving. One portion of this dish contains about <b>34g of protein</b>, <b>37g of fat</b>, and a total of <b>639 calories</b>. From preparation to the plate, this recipe takes about <b>45 minutes</b>. This recipe is liked by 8 foodies and cooks. This recipe from Foodista requires the shrimp, salt and pepper, garlic cloves, and the dressing. All things considered, we decided this recipe <b>deserves a spoonacular score of 86%</b>. This score is outstanding. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/shrimp-corn-california-avocado-pasta-salad-a-ca-avocado-trip-584558\">Shrimp, Corn & Californian Avocado Pasta Salad & a CAn Avocado Trip</a>, <a href=\"https://spoonacular.com/recipes/shrimp-corn-california-avocado-pasta-salad-a-ca-avocado-trip-1236119\">Shrimp, Corn & Californian Avocado Pasta Salad & a CAn Avocado Trip</a>, and <a href=\"https://spoonacular.com/recipes/shrimp-corn-california-avocado-pasta-salad-a-ca-avocado-trip-1219445\">Shrimp, Corn & Californian Avocado Pasta Salad & a CAn Avocado Trip</a>."
    },
    "instructions": {
      "en": "1.Firstly, to cook the shrimp, heat the olive oil in a pan and once hot add the shrimp crushed garlic and chili flakes. It is important to get the oil nice and hot (not smoking, just before that point) your shrimp should sizzle when added to the pan. Check the back of the shrimp and when you see the colour change about half way up, turn them over. Do the same on the other side. This should only take a minute to two minutes maximum on both sides  otherwise you will get a rubbery result if you leave it too long. Squeeze over the lime juice  this too should bubble and reduce. Add a little salt and pepper, stir through, remove from the heat and set aside.\n2.Mix the dressing ingredients together, check for flavour, adjust if need be and set aside.\n3.Place all the salad ingredients in a bowl except the avocado and the salt and pepper. Prepare the avocado as you are about to serve otherwise it will turn brown. Once it is covered in the lime dressing, this will slow down the oxidization process and it wont go brown so easily.\n4.When you are ready to serve mix  of the avocado through the salad and add the dressing. Toss everything together. Taste to see if you need any salt and pepper. Place your shrimp on top of the salad with the rest of the avocado and sprinkle/pour any residue from the pan over your salad in which you cooked the shrimp. This is great flavour, so you dont want to lose it."
    },
    "ingredients": [
      {
        "en": "The Shrimp"
      },
      {
        "en": "About 600gr of large tiger style shrimp (prawns/langoustine) peeled and cleaned"
      },
      {
        "en": "2 x garlic cloves, crushed"
      },
      {
        "en": "1 x tbsp olive oil"
      },
      {
        "en": "Juice of 1 lime"
      },
      {
        "en": "Salt and Pepper"
      },
      {
        "en": "The Salad"
      },
      {
        "en": "The leaves of 1 medium Cos lettuce finely shredded"
      },
      {
        "en": "6/8 basil leaves chopped"
      },
      {
        "en": "200gr sweet corn"
      },
      {
        "en": "3 x spring onions (scallions) chopped finely"
      },
      {
        "en": "600gr fresh pineapple cut into small cubes"
      },
      {
        "en": "2 x avocados chopped into cubes"
      },
      {
        "en": "Avocado"
      },
      {
        "en": "The Dressing"
      },
      {
        "en": "3 x tbsp olive oil"
      },
      {
        "en": "3 x tbsp honey"
      },
      {
        "en": "Juice and zest of 3 limes"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/659927-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 4,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      },
      {
        "en": "pescatarian"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "side dish"
      },
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "salad"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "frying pan"
      },
      {
        "en": "bowl"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/ZTNWCWQP/shrimp-and-avocado-salad"
  },
  {
    "id": "cL0SWEDIooXovtHlejEg",
    "title": {
      "en": "Salmon Quinoa Risotto"
    },
    "summary": {
      "en": "Salmon Quinoa Risotto might be just the main course you are searching for. One serving contains <b>437 calories</b>, <b>25g of protein</b>, and <b>20g of fat</b>. This recipe serves 4. For <b>$3.83 per serving</b>, this recipe <b>covers 43%</b> of your daily requirements of vitamins and minerals. Head to the store and pick up quinoa, poached salmon, olive oil, and a few other things to make it today. It is a good option if you're following a <b>gluten free, dairy free, and pescatarian</b> diet. It is a <b>rather expensive</b> recipe for fans of Mediterranean food. 3 people found this recipe to be yummy and satisfying. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. It is brought to you by Foodista. Overall, this recipe earns an <b>outstanding spoonacular score of 94%</b>. Similar recipes include <a href=\"https://spoonacular.com/recipes/salmon-quinoa-risotto-1360771\">Salmon Quinoa Risotto</a>, <a href=\"https://spoonacular.com/recipes/salmon-quinoa-risotto-1288579\">Salmon Quinoa Risotto</a>, and <a href=\"https://spoonacular.com/recipes/quinoa-risotto-with-salmon-and-kale-15276\">Quinoa Risotto With Salmon And Kale</a>."
    },
    "instructions": {
      "en": "In a 4 quart saucepan, heat 2 tablespoons of olive oil over medium high heat.\nWhen oil is shimmering, add diced onion.\nSaute onion until transparent.  Add quinoa to onion mixture and stir, to toast quinoa, for 2 minutes.\nAdd 1 cup of vegetable stock to quinoa and onions.\nStir until stock is absorbed.  Once stock is absorbed, add 1 cup of stock.\nContinue stirring until stock is absorbed.\nAdd remaining stock in 1/2 cup intervals, stirring until all stock is absorbed.\nRemove from heat.\nWhile preparing the onion quinoa mixture, heat 1 tablespoon of oil in a saute pan with chopped garlic (over medium high heat).\nOnce garlic is sizzling, add chopped kale to the pan.\nTurn kale to coat with oil and garlic.\nTurn kale mixture until fragrant (approximately 2 minutes).  Remove kale mixture from heat.\nOnce quinoa is complete, add kale and salmon.\nStir to combine.\nAdd salt and pepper to taste."
    },
    "ingredients": [
      {
        "en": "1 cup Quinoa"
      },
      {
        "en": "1 medium Onion (diced)"
      },
      {
        "en": "8 Leaves of Kale (stems removed and cut into ribbons)"
      },
      {
        "en": "5 Garlic Cloves (finely chopped)"
      },
      {
        "en": "3 tablespoons Olive Oil (divided)"
      },
      {
        "en": "10 ounces Poached Salmon (flaked)*"
      },
      {
        "en": "32 ounces Organic Vegetable Stock"
      },
      {
        "en": "Salt"
      },
      {
        "en": "Pepper"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/659109-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 4,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      },
      {
        "en": "pescatarian"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "side dish"
      },
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [
      {
        "en": "Mediterranean"
      },
      {
        "en": "Italian"
      },
      {
        "en": "European"
      }
    ],
    "equipment": [
      {
        "en": "sauce pan"
      },
      {
        "en": "frying pan"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/KH5STR7N/salmon-quinoa-risotto"
  },
  {
    "id": "dhcHyP8PNnh8Oni4SQMz",
    "title": {
      "en": "Ginger Chicken Stir-Fry"
    },
    "summary": {
      "en": "Ginger Chicken Stir-Fry requires roughly <b>45 minutes</b> from start to finish. This main course has <b>320 calories</b>, <b>22g of protein</b>, and <b>9g of fat</b> per serving. This recipe serves 6 and costs $1.52 per serving. 2 people were impressed by this recipe. It is a good option if you're following a <b>gluten free and dairy free</b> diet. This recipe from Foodista requires broccoli/cauliflower/carrots, ground ginger, chicken broth, and cornstarch. Taking all factors into account, this recipe <b>earns a spoonacular score of 58%</b>, which is pretty good. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/ginger-chicken-stir-fry-110515\">Ginger Chicken Stir-fry</a>, <a href=\"https://spoonacular.com/recipes/ginger-chicken-stir-fry-1365259\">Ginger Chicken Stir-Fry</a>, and <a href=\"https://spoonacular.com/recipes/ginger-chicken-stir-fry-105193\">Ginger Chicken Stir-Fry</a>."
    },
    "instructions": {
      "en": "<ol><li>In shallow baking dish, combine teriyaki sauce and water; add chicken pieces, coating well. Cover and refrigerate two hours. Drain marinade from chicken pieces. In large skillet or wok, heat oil; stir-fry chicken and onion until chicken is slightly browned. Stir in vegetables, ginger, and wine. Cover; simmer 4 to 5 minutes, or until vegetables are tender crisp. In small bowl, combine cornstarch and water until smooth.</li><li>Gradually add to skillet, stirring constantly, until thickened. Serve over hot rice.</li><li>*Or use 1 package (16 ounces) frozen vegetable mixture of your choice.</li><li>NOTE: Optional ingredients are omitted from the nutritional calculations.</li><li>When ingredient options appear in a recipe, the first ingredient choice is used for calculation.</li></ol>"
    },
    "ingredients": [
      {
        "en": "16 ounces Broccoli/cauliflower/carrots (frozen packaged mixture)*"
      },
      {
        "en": "1 pound Chicken breasts (skinned and boned) cut into 1-½ inch pieces"
      },
      {
        "en": "cup White wine OR chicken broth"
      },
      {
        "en": "3 cups Hot cooked brown rice"
      },
      {
        "en": "1 tablespoon Cornstarch"
      },
      {
        "en": "2 teaspoon ground ginger"
      },
      {
        "en": "1 medium Onion, cut into 8 wedges"
      },
      {
        "en": "1/4 cup Teriyaki sauce"
      },
      {
        "en": "3/4 cup canola or vegetable oil"
      },
      {
        "en": "3 cups water"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/644571-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 6,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "baking pan"
      },
      {
        "en": "frying pan"
      },
      {
        "en": "bowl"
      },
      {
        "en": "wok"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/HVGBX52M/ginger-chicken-stir-fry"
  },
  {
    "id": "nuccr2g9Zp1TaZOCEpeK",
    "title": {
      "en": "Gluten Free Almond Blueberry Coffee Cake"
    },
    "summary": {
      "en": "You can never have too many breakfast recipes, so give Gluten Free Almond Blueberry Coffee Cake a try. Watching your figure? This gluten free and lacto ovo vegetarian recipe has <b>299 calories</b>, <b>6g of protein</b>, and <b>11g of fat</b> per serving. This recipe serves 8. For <b>68 cents per serving</b>, this recipe <b>covers 6%</b> of your daily requirements of vitamins and minerals. It is brought to you by Pink When. A couple people made this recipe, and 39 would say it hit the spot. Head to the store and pick up almonds, baking powder, milk, and a few other things to make it today. From preparation to the plate, this recipe takes approximately <b>1 hour</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 29%</b>. This score is rather bad. Try <a href=\"https://spoonacular.com/recipes/gluten-free-blueberry-coffee-cake-541568\">Gluten-free Blueberry Coffee Cake</a>, <a href=\"https://spoonacular.com/recipes/gluten-free-blueberry-coffee-cake-1726819\">Gluten-Free Blueberry Coffee Cake</a>, and <a href=\"https://spoonacular.com/recipes/gluten-free-almond-and-raspberry-coffee-cake-553169\">Gluten free almond and raspberry coffee cake</a> for similar recipes."
    },
    "instructions": {
      "en": "<ol><li>Preheat your oven to 375 degrees F and spray a 9\" springform pan with a nonstick spray. Set aside.</li><li>In a large bowl, whisk together the egg, whole milk, vanilla yogurt and canola oil. Set aside.</li><li>In a separate medium bowl, whisk together 2 cups of the flour, granulated sugar, baking powder, xantham gum and fine sea salt.</li><li>Add the dry ingredients to the wet and mix to combine until just moistened. Do not overmix.</li><li>In a small bowl, combine 1 cup of the blueberries with the remaining 1 tablespoon flour. Fold the blueberries into the batter very gently until dispersed evenly. It is OK if they bleed just a little bit.</li><li>Pour the batter into the prepared pan and flatten and even out with a spatula. Top with the remaining blueberries.</li><li>In a small bowl toss the turbinado sugar and almonds together. Sprinkle on top of the cake. Transfer the cake to the oven ad bake for 30-35 minutes or until a toothpick comes out with just a few crumbs. Remove from heat and let cool in the pan for 15 minutes. Release the sides and transfer the cake to a wire rack to cool the rest of the way.</li><li>Enjoy immediately or cover with plastic wrap and eat within 2 days.</li></ol>"
    },
    "ingredients": [
      {
        "en": "3 tablespoons sliced almonds"
      },
      {
        "en": "3 teaspoons baking powder (without wheat starch)"
      },
      {
        "en": "1½ cup frozen blueberries"
      },
      {
        "en": "¼ cup canola oil"
      },
      {
        "en": "1 large egg"
      },
      {
        "en": "2 cups gluten free all-purpose flour + 1 tablespoon"
      },
      {
        "en": "½ cup granulated sugar"
      },
      {
        "en": "½ teaspoon fine sea salt"
      },
      {
        "en": "3 tablespoons raw turbinado sugar"
      },
      {
        "en": "½ cup vanilla yogurt"
      },
      {
        "en": "½ cup whole milk"
      },
      {
        "en": "1 teaspoon xanthan gum"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/729532-556x370.jpg",
    "readyInMinutes": 60,
    "servings": 8,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "lacto ovo vegetarian"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "morning meal"
      },
      {
        "en": "dessert"
      },
      {
        "en": "brunch"
      },
      {
        "en": "breakfast"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "springform pan"
      },
      {
        "en": "whisk"
      },
      {
        "en": "bowl"
      },
      {
        "en": "oven"
      },
      {
        "en": "spatula"
      },
      {
        "en": "frying pan"
      },
      {
        "en": "toothpicks"
      },
      {
        "en": "plastic wrap"
      },
      {
        "en": "wire rack"
      }
    ],
    "sourceUrl": "https://www.pinkwhen.com/gluten-free-almond-blueberry-coffee-cake/"
  },
  {
    "id": "r7Wcf84nanQhrUFIYpoe",
    "title": {
      "en": "Big Batch Smoothie Bowl"
    },
    "summary": {
      "en": "Big Batch Smoothie Bowl could be just the <b>lacto ovo vegetarian</b> recipe you've been looking for. This recipe makes 6 servings with <b>434 calories</b>, <b>22g of protein</b>, and <b>18g of fat</b> each. For <b>$1.74 per serving</b>, this recipe <b>covers 19%</b> of your daily requirements of vitamins and minerals. It works well as a reasonably priced main course. It is brought to you by spoonacular user <a href=\"/profile/coffeebean\">coffeebean</a>. From preparation to the plate, this recipe takes about <b>15 minutes</b>. Head to the store and pick up whey protein, pumpkin seeds, flaxseed, and a few other things to make it today. Similar recipes include <a href=\"https://spoonacular.com/recipes/big-batch-smoothie-bowl-1405579\">Big Batch Smoothie Bowl</a>, <a href=\"https://spoonacular.com/recipes/big-batch-smoothie-bowl-1375399\">Big Batch Smoothie Bowl</a>, and <a href=\"https://spoonacular.com/recipes/big-batch-brownies-246947\">Big Batch Brownies</a>."
    },
    "instructions": {
      "en": "<ol><li>Blend frozen berries, kefir, and protein powder. It is best to do this in advance so it's not too icy cold.</li><li>Portion out each serving and top with sliced bananas, pomegranate seeds, granola, ground nuts, and flax.</li><li>Enjoy!</li></ol>"
    },
    "ingredients": [
      {
        "en": "90 grams whey protein"
      },
      {
        "en": "150 grams frozen strawberries"
      },
      {
        "en": "150 grams frozen blueberries"
      },
      {
        "en": "3 bananas"
      },
      {
        "en": "1 pomegranate"
      },
      {
        "en": "60 grams walnuts"
      },
      {
        "en": "30 grams pumpkin seeds"
      },
      {
        "en": "30 grams flaxseed"
      },
      {
        "en": "180 grams granola"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/1082038-556x370.jpg",
    "readyInMinutes": 15,
    "servings": 6,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "lacto ovo vegetarian"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [],
    "sourceUrl": "https://spoonacular.com/site-1552846959904"
  },
  {
    "id": "twqpgGy6WIKHCGiCPoiD",
    "title": {
      "en": "Finger Lickin' Good Stewed Quince Dessert"
    },
    "summary": {
      "en": "Finger Lickin' Good Stewed Quince Dessert is a hor d'oeuvre that serves 6. For <b>$2.87 per serving</b>, this recipe <b>covers 5%</b> of your daily requirements of vitamins and minerals. One portion of this dish contains about <b>1g of protein</b>, <b>7g of fat</b>, and a total of <b>190 calories</b>. This recipe from Foodista has 3 fans. A mixture of quinces, unrefined oil, cinnamon, and a handful of other ingredients are all it takes to make this recipe so yummy. It is a good option if you're following a <b>gluten free, dairy free, lacto ovo vegetarian, and vegan</b> diet. From preparation to the plate, this recipe takes around <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 19%</b>. This score is rather bad. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/finger-lickin-good-shrimp-428519\">Finger-Lickin'-Good Shrimp</a>, <a href=\"https://spoonacular.com/recipes/finger-lickin-good-chicken-marinade-143838\">Finger Lickin' Good Chicken Marinade</a>, and <a href=\"https://spoonacular.com/recipes/finger-lickin-good-bbq-sauce-146789\">Finger Lickin Good BBQ Sauce</a>."
    },
    "instructions": {
      "en": "Go to my blog for the full instructions: http://gourmandelle.com/finger-lickin-good-stewed-quince-dessert/"
    },
    "ingredients": [
      {
        "en": "3 quinces"
      },
      {
        "en": "3 tbsp unrefined oil"
      },
      {
        "en": "1 tbsp rice flour, mixed with 50 ml of water"
      },
      {
        "en": "50g sucanat"
      },
      {
        "en": "1/2 tbsp cinnamon"
      },
      {
        "en": "1 tsp ground cloves"
      },
      {
        "en": "3 tbsp raisins"
      },
      {
        "en": "1/2 tsp vanilla extract"
      },
      {
        "en": "1 tsp rum extract"
      },
      {
        "en": "pinch of sea salt"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/642878-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 6,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      },
      {
        "en": "lacto ovo vegetarian"
      },
      {
        "en": "vegan"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "antipasti"
      },
      {
        "en": "soup"
      },
      {
        "en": "starter"
      },
      {
        "en": "snack"
      },
      {
        "en": "appetizer"
      },
      {
        "en": "antipasto"
      },
      {
        "en": "hor d'oeuvre"
      }
    ],
    "cuisines": [],
    "equipment": [],
    "sourceUrl": "https://www.foodista.com/recipe/RKFS2WGC/finger-lickin-good-stewed-quince-dessert"
  },
  {
    "id": "yoZhLyZoTOSiCMu7dDh7",
    "title": {
      "en": "Creamy Potato Salad with Cashew Dressing and Fresh Basil"
    },
    "summary": {
      "en": "The recipe Creamy Potato Salad with Cashew Dressing and Fresh Basil can be made <b>in around 45 minutes</b>. One serving contains <b>292 calories</b>, <b>8g of protein</b>, and <b>17g of fat</b>. This gluten free and dairy free recipe serves 6 and costs <b>$1.81 per serving</b>. 18 people were impressed by this recipe. It can be enjoyed any time, but it is especially good for <b>The Fourth Of July</b>. Head to the store and pick up parsley, baby potatoes, mint leaves, and a few other things to make it today. A few people really liked this side dish. It is brought to you by foodandspice.blogspot.com. With a spoonacular <b>score of 86%</b>, this dish is excellent. Similar recipes include <a href=\"https://spoonacular.com/recipes/wedge-salad-with-creamy-cashew-dressing-1711069\">Wedge Salad with Creamy Cashew Dressing</a>, <a href=\"https://spoonacular.com/recipes/fresh-basil-salad-dressing-1628317\">Fresh Basil Salad Dressing</a>, and <a href=\"https://spoonacular.com/recipes/roasted-cauliflower-salad-with-creamy-cashew-dressing-926367\">Roasted Cauliflower Salad with Creamy Cashew Dressing</a>."
    },
    "instructions": {
      "en": "Bring the potatoes to a boil in a large pot of water. Reduce the heat to medium and cook until they are fork tender  about 10 to 12 minutes. Do not overcook. Drain well and let cool for 10 minutes or longer before transferring to a large bowl along with the peas, basil leaves and olives if using.To make the dressing, combine all the ingredients in a small blender or food processor and pulse into smooth. If it is too thick, add a bit more olive oil or almond milk. Taste for seasoning and adjust nutritional yeast, salt and pepper to taste. Toss the potatoes with the dressing and serve."
    },
    "ingredients": [
      {
        "en": "3 to 4 tablespoons almond milk, or as needed"
      },
      {
        "en": "1 1/2 lb (700 g) baby potatoes"
      },
      {
        "en": "3/4 cup fresh basil leaves, roughly torn if large"
      },
      {
        "en": "1 1/2 tablespoons fresh chives, chopped"
      },
      {
        "en": "1 tablespoon fresh mint leaves, chopped"
      },
      {
        "en": "2 tablespoons fresh parsley, trimmed and chopped"
      },
      {
        "en": "1/2 cup fresh or frozen peas, blanched"
      },
      {
        "en": "fresh ground black pepper to taste"
      },
      {
        "en": "1 teaspoon Dijon honey mustard"
      },
      {
        "en": "juice from 2 lemons (3 tablespoons)"
      },
      {
        "en": "1/4 Kalamata olives, pitted and chopped (optional)"
      },
      {
        "en": "3 to 4 tablespoons nutritional yeast, to taste"
      },
      {
        "en": "1/4 cup olive oil"
      },
      {
        "en": "3/4 cup raw cashews, soaked in warm water for 3 hours and drained"
      },
      {
        "en": "1 teaspoon rice vinegar"
      },
      {
        "en": "1 1/2 teaspoons sea salt, or to taste"
      },
      {
        "en": "1 teaspoon Dijon grain mustard"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/794352-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 6,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "side dish"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "pot"
      },
      {
        "en": "food processor"
      },
      {
        "en": "blender"
      },
      {
        "en": "bowl"
      }
    ],
    "sourceUrl": "https://www.foodandspice.com/2016/07/creamy-potato-salad-with-cashew.html"
  },
  {
    "id": "zhsbk934lXYoiO2L6j59",
    "title": {
      "en": "Curried Chicken Roll-Ups"
    },
    "summary": {
      "en": "Curried Chicken Roll-Ups requires around <b>45 minutes</b> from start to finish. One portion of this dish contains about <b>13g of protein</b>, <b>6g of fat</b>, and a total of <b>180 calories</b>. For <b>$1.37 per serving</b>, you get a hor d'oeuvre that serves 4. This recipe is liked by 3 foodies and cooks. If you have chicken breast, curry paste, paprika, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. It is a good option if you're following a <b>gluten free and dairy free</b> diet. Taking all factors into account, this recipe <b>earns a spoonacular score of 48%</b>, which is pretty good. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/chicken-roll-ups-1300115\">Chicken Roll-ups</a>, <a href=\"https://spoonacular.com/recipes/chicken-roll-em-ups-for-two-419709\">Chicken Roll-em Ups for Two</a>, and <a href=\"https://spoonacular.com/recipes/chicken-roll-ups-67637\">Chicken Roll-ups</a>."
    },
    "instructions": {
      "en": "Place all ingredients (except tortillas, lettuce, and cream cheese) into a bowl. Stir well, until everything is nicely mixed and the larger chicken pieces have pulled apart.\nLightly toast or warm your tortillas on the stove top.\nScoop out a quarter of your chicken salad mixture and evenly spread it over the top of the tortilla.\nSprinkle a quarter of your lettuce over the chicken salad.\nNow gently, and tightly, roll up your tortilla.\nUse a good serrated knife to gently slice the roll into 4 or 6 pieces."
    },
    "ingredients": [
      {
        "en": "10 ounce can chopped chicken breast, drained"
      },
      {
        "en": "1/2 medium cucumber, diced"
      },
      {
        "en": "1/4 red bell pepper, diced"
      },
      {
        "en": "1 celery stalk, diced"
      },
      {
        "en": "1 green onion, sliced"
      },
      {
        "en": "3 tablespoons light mayonnaise or Vegenaise"
      },
      {
        "en": "1 teaspoon lime juice"
      },
      {
        "en": "1 teaspoon red curry paste"
      },
      {
        "en": "1/2 teaspoon garlic powder"
      },
      {
        "en": "1/2 teaspoon paprika"
      },
      {
        "en": "Dash of chili powder"
      },
      {
        "en": "Salt and pepper, to taste"
      },
      {
        "en": "4 whole grain tortillas"
      },
      {
        "en": "1 cup lettuce, chopped"
      }
    ],
    "image": "https://img.spoonacular.com/recipes/641066-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 4,
    "calories": {
      "min": null,
      "max": null
    },
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      }
    ],
    "intolerances": [],
    "dishTypes": [
      {
        "en": "antipasti"
      },
      {
        "en": "starter"
      },
      {
        "en": "snack"
      },
      {
        "en": "appetizer"
      },
      {
        "en": "antipasto"
      },
      {
        "en": "hor d'oeuvre"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "bowl"
      },
      {
        "en": "stove"
      },
      {
        "en": "serrated knife"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/3M5MRTD8/curried-chicken-roll-ups"
  }
]