[
  {
    "id": "0a1NbKNL0Bg0k4kdRsnG",
    "title": {
      "en": "Black Bean Mango Stir Fry with Cilantro Lime Coconut Sauce"
    },
    "summary": {
      "en": "Need a dairy free hor d'oeuvre? Black Bean Mango Stir Fry with Cilantro Lime Coconut Sauce could be a great recipe to try. For $2.83 per serving, this recipe covers 16% of your daily requirements of vitamins and minerals. This recipe makes 8 servings with 359 calories, 10g of protein, and 8g of fat each. This recipe from Foodista has 3 fans. A mixture of garlic, sriracha sauce/red pepper flakes if desired, agave nectar, and a handful of other ingredients are all it takes to make this recipe so scrumptious. From preparation to the plate, this recipe takes about 45 minutes. With a spoonacular score of 53%, this dish is solid. Similar recipes include Beef Stir-fry With Black Bean Sauce, Stir-fry Broccoli With Black Bean Sauce, and Asparagus Stir-Fry With Black Bean Sauce."
    },
    "instructions": {
      "en": [
        "Directions: To make the sauce, blend the coconut milk, cilantro, lime juice, ginger, garlic, soy sauce and agave nectar in a blender until smooth; set aside. Prepare rice noodles according to instructions (they often vary). In a large, deep skillet or wok over medium-high, heat oil until shimmering. Add crab/shrimp oil and saut until cooked through and lightly browned, about 4 to 5 minutes. Add veggies and mango and saut until veggies are lightly tender, about 4 to 5 minutes longer. Stir in the stir fry sauce and noodles. Cook for another minute or until the noodles are hot. Sprinkle with additional sriraccha, salt and pepper and red pepper flakes as desired. Makes 8 servings."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "peanut oil",
          "amount": "2 tablespoons(2Tbsps)"
        },
        {
          "name": "snow pea pods",
          "amount": "2 cups(196g)"
        },
        {
          "name": "carrot",
          "amount": "1 cup(128g)"
        },
        {
          "name": "cucumber",
          "amount": "1 cup(133g)"
        },
        {
          "name": "cabbage",
          "amount": "1 cup(89g)"
        },
        {
          "name": "corn",
          "amount": "2 cups(290g)"
        },
        {
          "name": "black beans",
          "amount": "2 cups(344g)"
        },
        {
          "name": "mango",
          "amount": "1 (1)"
        },
        {
          "name": "imitation crab meat/shrimp",
          "amount": "2 cups(360ml)"
        },
        {
          "name": "rice noodles",
          "amount": "8 ounce(226.796g)"
        },
        {
          "name": "sriracha sauce/red pepper flakes if desired",
          "amount": "8 servings(8servings)"
        },
        {
          "name": "salt and pepper",
          "amount": "8 servings(8servings)"
        },
        {
          "name": "coconut milk",
          "amount": "2 cups(400ml)"
        },
        {
          "name": "cilantro",
          "amount": "1 cup(16g)"
        },
        {
          "name": "juice of lime",
          "amount": "2 (2)"
        },
        {
          "name": "ginger root",
          "amount": "2 inches(2inches)"
        },
        {
          "name": "garlic",
          "amount": "2 cloves(2cloves)"
        },
        {
          "name": "agave nectar",
          "amount": "2 tablespoons(2Tbsps)"
        },
        {
          "name": "soy sauce",
          "amount": "3 tablespoons(3Tbsps)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/635070-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 8,
    "diets": [
      {
        "en": "dairy free"
      }
    ],
    "dishTypes": [
      {
        "en": "antipasti"
      },
      {
        "en": "starter"
      },
      {
        "en": "snack"
      },
      {
        "en": "appetizer"
      },
      {
        "en": "antipasto"
      },
      {
        "en": "hor d'oeuvre"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "blender"
      },
      {
        "en": "frying pan"
      },
      {
        "en": "wok"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/N75MR226/black-bean-mango-stir-fry-with-cilantro-lime-coconut-sauce"
  },
  {
    "id": "2PNJbsHUrQzla65jF2N8",
    "title": {
      "en": "Creamy Polenta with Egg, Arrabiata & Bacon"
    },
    "summary": {
      "en": "If you have roughly 45 minutes to spend in the kitchen, Creamy Polenta with Egg, Arrabiata & Bacon might be an outstanding gluten free recipe to try. For $2.88 per serving, this recipe covers 18% of your daily requirements of vitamins and minerals. This recipe serves 4. One serving contains 667 calories, 24g of protein, and 48g of fat. This recipe from Foodista requires polenta, cream cheese, goat cheese, and parsley. 103 people have tried and liked this recipe. It works well as a main course. All things considered, we decided this recipe deserves a spoonacular score of 53%. This score is solid. Creamy Polenta with Bacon and Sage, Creamy Polenta with Bacon and Cranberries, and Poached Egg over Creamy Polenta are very similar to this recipe."
    },
    "instructions": {
      "en": [
        "Step 1: Preheat the oven to 425 degrees F.",
        "Step 2: Bring 4 cups of water to a boil in a medium saucepan. Slowly whisk in the polenta, whisking continuously until there are no lumps and it begins to thicken slightly. Reduce the heat to medium-low and allow the polenta to simmer for 30 minutes, stirring occasionally to keep it from overcooking.",
        "Step 3: When the polenta has thickened and become tender, stir in the goat cheese and cream cheese. Stir until the cheese are melted and fully incorporated into the polenta. Add salt and pepper to taste.",
        "Step 4: Meanwhile, place the bacon on a parchment-lined baking sheet and place in the preheated oven on the middle rack. Roast for 15-18 minutes or until the bacon is golden and crisp. When it is done, remove it from the oven and place the bacon strips on a paper towel-lined plate. Set aside.",
        "Step 5: In a small saucepan or in the microwave, heat the marinara sauce until just simmering. Keep warm until you are ready to assemble your bowls.",
        "Step 6: In a large non-stick skillet, heat the 1 T olive oil over medium heat. If your pan is large enough, add the four eggs and allow them to cook until the whites are opaque but still a bit runny on the top. Put a lid over the pan and turn off the heat. Allow the eggs to continue cooking under the lid until the whites are set but the yolk is still runny. If your pan is small, fry the eggs in batches.",
        "Step 7: To assemble the bowls, spoon even amounts of polenta in each bowl. Top with a spoonful of the arrabiata, 1 egg and 2 slices of bacon. Garnish with chopped thyme or parsley leaves. Serve immediately."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "bacon",
          "amount": "8 slices(8slice)"
        },
        {
          "name": "cream cheese",
          "amount": "2 oz(56.699g)"
        },
        {
          "name": "eggs",
          "amount": "4 (4)"
        },
        {
          "name": "parsley",
          "amount": "4 servings(4servings)"
        },
        {
          "name": "goat cheese",
          "amount": "4 oz(113.398g)"
        },
        {
          "name": "olive oil",
          "amount": "1 tablespoon(1Tbsp)"
        },
        {
          "name": "polenta",
          "amount": "1 cup(159g)"
        },
        {
          "name": "salt & pepper",
          "amount": "4 servings(4servings)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/640676-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 4,
    "diets": [
      {
        "en": "gluten free"
      }
    ],
    "dishTypes": [
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "whisk"
      },
      {
        "en": "sauce pan"
      },
      {
        "en": "oven"
      },
      {
        "en": "baking sheet"
      },
      {
        "en": "paper towels"
      },
      {
        "en": "microwave"
      },
      {
        "en": "frying pan"
      },
      {
        "en": "bowl"
      }
    ],
    "sourceUrl": "http://www.foodista.com/recipe/WPBY4PQQ/creamy-polenta-with-egg-arrabiata-bacon"
  },
  {
    "id": "3u2KyLEecQTKPuX7xIS0",
    "title": {
      "en": "Edamame Hummus"
    },
    "summary": {
      "en": "Need a gluten free, dairy free, lacto ovo vegetarian, and vegan hor d'oeuvre? Edamame Hummus could be an awesome recipe to try. This recipe serves 6. For 67 cents per serving, this recipe covers 6% of your daily requirements of vitamins and minerals. One serving contains 177 calories, 6g of protein, and 14g of fat. It is brought to you by Foodista. 4 people were glad they tried this recipe. This recipe is typical of middl eastern cuisine. If you have ground coriander, garlic, flat-leaf parsley, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes about 45 minutes. Overall, this recipe earns a solid spoonacular score of 56%. Edamame Hummus, Edamame Hummus, and Edamame Hummus are very similar to this recipe."
    },
    "instructions": {
      "en": [
        "Step 1: Boil the edamame in salted water for 4 to 5 minutes. Drain.",
        "Step 2: In a food processor, puree the Edamame, tahini, water, lemon zest and juice, garlic, salt, cumin, coriander, and chili flakes (optional) until smooth.",
        "Step 3: With the motor running, slowly drizzle in 2 tablespoons of olive oil and mix until absorbed.",
        "Step 4: Transfer to a small bowl, stir in the parsley and drizzle with remaining oil. Serve, or refrigerate, covered, up to 3 days."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "chili flakes",
          "amount": "0.25 teaspoon(0.25tsps)"
        },
        {
          "name": "edamame",
          "amount": "8 oz(226.796g)"
        },
        {
          "name": "flat-leaf parsley",
          "amount": "1 tablespoon(1Tbsp)"
        },
        {
          "name": "garlic",
          "amount": "4 cloves(4cloves)"
        },
        {
          "name": "ground coriander",
          "amount": "0.25 teaspoon(0.25tsps)"
        },
        {
          "name": "ground cumin",
          "amount": "0.5 teaspoon(0.5tsps)"
        },
        {
          "name": "kosher salt",
          "amount": "0.75 teaspoon(0.75tsps)"
        },
        {
          "name": "lemon",
          "amount": "1 (1)"
        },
        {
          "name": "lemon zest",
          "amount": "0.5 teaspoon(0.5tsps)"
        },
        {
          "name": "olive oil",
          "amount": "3 tablespoons(3Tbsps)"
        },
        {
          "name": "tahini",
          "amount": "0.25 cup(60ml)"
        },
        {
          "name": "water",
          "amount": "3 cups(709.764ml)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/642169-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 6,
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      },
      {
        "en": "lacto ovo vegetarian"
      },
      {
        "en": "vegan"
      }
    ],
    "dishTypes": [
      {
        "en": "antipasti"
      },
      {
        "en": "condiment"
      },
      {
        "en": "starter"
      },
      {
        "en": "snack"
      },
      {
        "en": "appetizer"
      },
      {
        "en": "dip"
      },
      {
        "en": "antipasto"
      },
      {
        "en": "hor d'oeuvre"
      },
      {
        "en": "spread"
      }
    ],
    "cuisines": [
      {
        "en": "Middle Eastern"
      }
    ],
    "equipment": [
      {
        "en": "food processor"
      },
      {
        "en": "bowl"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/JP74GT52/edamame-hummus"
  },
  {
    "id": "4YGs7CmP6dNvMNfvUyhc",
    "title": {
      "en": "Baked Eggs and Bacon Cream In Spinach Fettuccine Nests"
    },
    "summary": {
      "en": "The recipe Baked Eggs and Bacon Cream In Spinach Fettuccine Nests can be made in about 45 minutes. For $1.66 per serving, this recipe covers 14% of your daily requirements of vitamins and minerals. One portion of this dish contains about 21g of protein, 51g of fat, and a total of 556 calories. This recipe serves 3. 4 people have made this recipe and would make it again. Head to the store and pick up bacon, heavy cream, scallions, and a few other things to make it today. It works well as an affordable main course. It is brought to you by Foodista. All things considered, we decided this recipe deserves a spoonacular score of 35%. This score is not so amazing. If you like this recipe, take a look at these similar recipes: Baked Eggs With Bacon And Spinach, Baked Eggs with Spinach Bacon and Avocado, and Fettuccine with Bacon and Eggs."
    },
    "instructions": {
      "en": [
        "I begin with my bacon (Ive never had bacon this fresh before, from an entirely organic source so close to home that my husband is literally feeding next seasons pork belly), which I chop and try out to nice crispy cubelets. Now the rest of the meal will take less than 25 minutes: 10 minutes to boil the pasta, make the sauce, and assemble the dish (and, if youre like me, some sub-urb biscuits), and 15 minutes to bake it (while you make a quick salad). So be ready. I melt my butter in my wok over high heat. I throw my pasta nests into the salted boiling water on the back burner. When my butter is melted and just begging to tan, I add my heavy cream and blend well. I bring this to a simmer for a moment. Then I add 3/4 of my cheese, which Ive shredded. (The rest I will thinly shave for a final garnish.) I blend this well, bringing it to a low simmer to thicken, until it forms a smooth sauce. I also add some salt and pepper. (Crushed red pepper flakes, nutmeg, paprika, maybe even a dash of curry powder would work nicely here, too.) Finally, I add 3/4 of my cooked bacon, and blend well with the sauce, until the flavors are beautifully infused. Its been 10 minutes, and my 11 minute pasta is just slightly undercooked (I know, cuz I bit off a snippet) perfect! Using tongs and a meshed spoon, I transfer my pasta to the waiting bacon cream, and toss well. I add a tablespoon, maybe, of the pasta water, too, just to keep the sauce wet enough to bake later. Using my tongs, I spin 1/2 of the pasta and sauce into each of two medium (10oz) ceramic ramekins, which Ive brushed down with melted butter. I sprinkle most of the rest of my bacon (reserving a few chunks for a final flourish) on top. The piece of resistance: a whole, cracked, raw egg, dropped into a wee basket I left in the middle of my pasta and sauce nests. I manage to keep the yolk whole only in one, but the other I rather hold together by virtue of a cleverly placed noodle and some dribbled sauce. I place these into a 350 oven to bake for 15 minutes, or until the whites have set, but the yolk is still glossy and runny. After coring the best bits out of a loaf of bread destined for nothing (since my husband purchased a fresher loaf of preferred pan this afternoon) with a properly sized wine-glass rim, I brushed each disk with melted butter, and layered them with some of my sprinkled cheese into 4 cups of a buttered muffin tin, and then I stuck them in my oven along with my pasta nests to brown. I consider these my sub-urb Wonderbread biscuits: quick, easy, and yummy, leaving fodder for crotons (or compost). I also threw together a quick salad of baby greens, sliced onion, strips of roasted red peppers, black olives, EVOO, and salt and pepper. Not that dinner needed these accoutrement my simmering, saucy noodle nests of runny yolk baked eggs, bac"
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "bacon",
          "amount": "3 slices(3slice)"
        },
        {
          "name": "butter",
          "amount": "0.5 stick(0.5stick)"
        },
        {
          "name": "parmigiano-reggiano",
          "amount": "0.25 pound(113.398g)"
        },
        {
          "name": "heavy cream",
          "amount": "0.5 cup(119ml)"
        },
        {
          "name": "eggs",
          "amount": "2 (2)"
        },
        {
          "name": "nests of spinach fettuccine",
          "amount": "2 large(2large)"
        },
        {
          "name": "salt and pepper",
          "amount": "3 servings(3servings)"
        },
        {
          "name": "scallions",
          "amount": "3 servings(3servings)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/633594-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 3,
    "diets": [],
    "dishTypes": [
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "morning meal"
      },
      {
        "en": "brunch"
      },
      {
        "en": "main dish"
      },
      {
        "en": "breakfast"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "oven"
      },
      {
        "en": "wok"
      },
      {
        "en": "tongs"
      },
      {
        "en": "ramekin"
      },
      {
        "en": "muffin tray"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/DWGPNSPQ/baked-eggs-and-bacon-cream-in-spinach-fettuccine-nests"
  },
  {
    "id": "GWKwbx2LA5P3vqSNteAk",
    "title": {
      "en": "Barnaby's Caesar Salad"
    },
    "summary": {
      "en": "If you want to add more pescatarian recipes to your recipe box, Barnaby's Caesar Salad might be a recipe you should try. This main course has 595 calories, 21g of protein, and 41g of fat per serving. For $2.38 per serving, this recipe covers 24% of your daily requirements of vitamins and minerals. This recipe serves 4. Only a few people really liked this American dish. A mixture of anchovy paste, parmigiano reggiano cheese, romaine lettuce, and a handful of other ingredients are all it takes to make this recipe so flavorful. 3 people found this recipe to be scrumptious and satisfying. It is brought to you by Foodista. From preparation to the plate, this recipe takes roughly 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 79%. This score is pretty good. If you like this recipe, you might also like recipes such as Grilled Caesar Salad with Light Caesar Salad Dressing, Chicken Caesar Salad with Garlic Croutons {and Light Caesar Dressing}, and Chicken Caesar Salad with Garlic Croutons {and Light Caesar Dressing}."
    },
    "instructions": {
      "en": [
        "Step 1: Combine lemon juice and anchovy paste in a blender.",
        "Step 2: Start blender and drizzle olive into mixture until it thickens.",
        "Step 3: Cut bread into 1 inch cubes and toast until brown. The trick here is to have it crispy on the outside and soft on the inside.",
        "Step 4: Combine lettuce and bread cubes in a salad bowl and cover with Parmigiano Reggiano (Parmesan) cheese.",
        "Step 5: Pour dressing over top and toss."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "anchovy paste",
          "amount": "1 tablespoon(1Tbsp)"
        },
        {
          "name": "ciabatta",
          "amount": "0.5 loaf(0.5loaf)"
        },
        {
          "name": "juice of lemon",
          "amount": "1 (1)"
        },
        {
          "name": "olive oil",
          "amount": "1 cup(216ml)"
        },
        {
          "name": "parmigiano reggiano cheese",
          "amount": "1.5 cups(150g)"
        },
        {
          "name": "cracked pepper",
          "amount": "4 servings(4servings)"
        },
        {
          "name": "romaine lettuce",
          "amount": "1 large head(1large head)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/634345-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 4,
    "diets": [
      {
        "en": "pescatarian"
      }
    ],
    "dishTypes": [
      {
        "en": "side dish"
      },
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "salad"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [
      {
        "en": "American"
      }
    ],
    "equipment": [
      {
        "en": "blender"
      },
      {
        "en": "bowl"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/222ZYXGD/barnabys-caesar-salad"
  },
  {
    "id": "LJFFxm5j0x30yrp0AQeB",
    "title": {
      "en": "Oreo Cake"
    },
    "summary": {
      "en": "Oreo Cake might be a good recipe to expand your dessert collection. For $2.39 per serving, this recipe covers 19% of your daily requirements of vitamins and minerals. One portion of this dish contains around 9g of protein, 39g of fat, and a total of 797 calories. This recipe serves 4. Only a few people made this recipe, and 5 would say it hit the spot. If you have butter, gal. vanillan ice cream, cool whip, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. From preparation to the plate, this recipe takes around 45 minutes. Overall, this recipe earns a solid spoonacular score of 44%. Users who liked this recipe also liked Oreo Mousse Filled Chocolate Trifecta Cake Using Cake Boss Mix, Oreo Mousse Filled Chocolate Trifecta Cake Using Cake Boss Mix, and Oreo Mousse Filled Chocolate Trifecta Cake Using Cake Boss Mix."
    },
    "instructions": {
      "en": [
        "Step 1: Crumble cookies and save 1/3 for topping. Mix butter and 2/3 cookie crumbs. Press into bottom of long cake pan. Layer 1/2 gallon of ice cream and 1/2 can of syrup. Layer Cool Whip. Add remaining cookie crumbs and chocolate syrup. Freeze overnight or at least 12 hours."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "butter",
          "amount": "0.25 cup(56.75g)"
        },
        {
          "name": "chocolate syrup",
          "amount": "1 can(1can)"
        },
        {
          "name": "cool whip",
          "amount": "16 oz(453.592g)"
        },
        {
          "name": "oreo cookies",
          "amount": "1 package(1pkg)"
        },
        {
          "name": "gal. vanilla ice cream",
          "amount": "0.5 (0.5)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/654018-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 4,
    "diets": [],
    "dishTypes": [
      {
        "en": "dessert"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "cake form"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/MQXQDZWD/oreo-cake"
  },
  {
    "id": "OGqNSRnKHJesF5uZVUEH",
    "title": {
      "en": "Spicy Chicken with Salsa Verde"
    },
    "summary": {
      "en": "Forget going out to eat or ordering takeout every time you crave Mexican food. Try making Spicy Chicken with Salsa Verde at home. This recipe makes 6 servings with 398 calories, 14g of protein, and 23g of fat each. For $1.81 per serving, this recipe covers 28% of your daily requirements of vitamins and minerals. Only a few people made this recipe, and 2 would say it hit the spot. From preparation to the plate, this recipe takes approximately 45 minutes. It is brought to you by Foodista. Head to the store and pick up jalapeño peppers, oregano, mint leaves, and a few other things to make it today. It works well as an affordable side dish. Taking all factors into account, this recipe earns a spoonacular score of 46%, which is solid. Try Spicy salsa verde chicken, Skillet Nachos with Spicy Salsa Verde Chicken, and Spicy Chicken Empanadas with Orange Salsa Verde for similar recipes."
    },
    "instructions": {
      "en": [
        "Step 1: Turn oven on to lowest setting and place your plates inside.",
        "Step 2: Prepare your pre bought flour tortilla wraps by sprinkling each tortilla with a little water then stacking them together, wrap in tin foil and place in the oven alongside the plates.",
        "Step 3: Prepare the chicken, cut chicken thighs into strips and mix with onion salt, chilli power, oregano, paprika and oil in a bowl and toss to coat. set aside.",
        "Step 4: Salsa Verde: Place the chili, garlic, green onion, coriander, mint and vegetable oil in a food processor and pulse until combined. Set aside later for serving. Makes 1 cup (250ml).",
        "Step 5: Guacamole: Scoop out flesh of 1 ripe Avocado, Chop and de-seed 1 red chilli and add to the Avocado, Squeeze in juice of 1/2 lime and mix to combine. Set aside later for serving",
        "Step 6: Sour Cream: Turn out tub of sour cream into a serving bowl, sprinkle lightly over the top with course black pepper. set aside.",
        "Step 7: Preheat a char-grill pan or barbecue over high heat. Char-grill or barbecue the chicken for 4-5 minutes each side or until cooked through.",
        "Step 8: Chop 1 red bell pepper into lengthy strips and toss on the hot griddle for 1 min.",
        "Step 9: Place the Chicken in a serving bowl, with pepper and bring the Salsa Verde, Guacamole and sour cream to the table along with hot plates and the tortilla wraps. Serve with extra fresh bowl of coriander leaves and lime wedges. .",
        "Step 10: Serves 6"
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "avocado",
          "amount": "1 medium(1medium)"
        },
        {
          "name": "chicken thigh fillets",
          "amount": "200 g(200g)"
        },
        {
          "name": "chili powder",
          "amount": "1 teaspoon(1tsp)"
        },
        {
          "name": "flour tortilla wraps",
          "amount": "1 package(1pkg)"
        },
        {
          "name": "coriander leaves",
          "amount": "0.25 cup(59.147g)"
        },
        {
          "name": "garlic",
          "amount": "2 cloves(2cloves)"
        },
        {
          "name": "green onions",
          "amount": "2 (2)"
        },
        {
          "name": "jalapeño peppers",
          "amount": "2 (2)"
        },
        {
          "name": "limes",
          "amount": "2 (2)"
        },
        {
          "name": "mint leaves",
          "amount": "0.25 cup(11.25g)"
        },
        {
          "name": "onion salt",
          "amount": "1 teaspoon(1tsp)"
        },
        {
          "name": "oregano",
          "amount": "1 teaspoon(1tsp)"
        },
        {
          "name": "paprika",
          "amount": "1 tsp(1tsp)"
        },
        {
          "name": "chilli",
          "amount": "1 (1)"
        },
        {
          "name": "cream",
          "amount": "1 small tub(1small tub)"
        },
        {
          "name": "vegetable oil",
          "amount": "1 Teaspoon(1tsp)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/661059-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 6,
    "diets": [],
    "dishTypes": [
      {
        "en": "side dish"
      }
    ],
    "cuisines": [
      {
        "en": "Mexican"
      }
    ],
    "equipment": [
      {
        "en": "food processor"
      },
      {
        "en": "grill pan"
      },
      {
        "en": "frying pan"
      },
      {
        "en": "grill"
      },
      {
        "en": "bowl"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/J2MM37RF/spicy-chicken-with-salsa-verde"
  },
  {
    "id": "PPpPCWs85EYeIBoEi7Qg",
    "title": {
      "en": "Warm Duck Salad With Roasted Beetroot"
    },
    "summary": {
      "en": "The recipe Warm Duck Salad With Roasted Beetroot can be made in around 45 minutes. This gluten free and primal recipe serves 4 and costs $5.81 per serving. This main course has 520 calories, 40g of protein, and 26g of fat per serving. Only a few people made this recipe, and 5 would say it hit the spot. Head to the store and pick up duck breast meat - skin left on, balsamic vinegar, arugula greens, and a few other things to make it today. It is brought to you by Foodista. Overall, this recipe earns a super spoonacular score of 88%. If you like this recipe, you might also like recipes such as Warm Duck Salad With Roasted Beetroot, Warm Duck Breast Salad With Spinach, Kalamatan Olives, Roasted P, and Shukhi – warm beetroot & mushroom salad."
    },
    "instructions": {
      "en": [
        "Pre-heat the oven to 200 deg Celsius (400 F). Start by roasting the beetroots. Clean the beets of all mud and trim the stems. Wrap each beet tightly in aluminum foil. Place the wrapped beets on a pan and in a 200 deg Celsius oven for 30 to 40mins. They are done when they are very tender. While the beets are cooking, use a peeler and peel an orange, taking note to get as much of zest and as little of pith (the white parts) as possible. Stack the strips of orange zest and cut into fine strips with a sharp knife. Set aside. Clean and dry the duck breasts. Score the skin of the duck. Make cuts into the fat layer and take care not to cut into the meat layer. Rub some salt into the skin side only of the duck. Add the duck breasts to a clean and COLD pan. Do not add any oil. Place the pan on the stove and turn the heat to medium. As the pan heats up, the fat from the duck will render off and the skin will brown beautifully. Always keep the heat to between medium to medium-high. Never use high heat as the skin will burn before the duck is cooked through. Once the skin is a gorgeous dark golden brown, flip the duck breasts to the other side and cook for a few more minutes till the other sides are also golden brown. Be careful not to overcook the duck. Set the cooked duck aside and leave to rest covered with foil. Duck, like beef must be rested. The resting time is half that of cooking time. If the duck was cooked for 6 mins, then it should be rested for at least 3 minutes. While the duck is resting, make the vinaigrette. Squeeze the juice of the zested orange into a bowl. About 5 to 6 tablespoons of juice. Add 2 tablespoons of extra virgin olive oil. Use the best quality one you have. Add 4 teaspoons of balsamic vinegar. Add salt and pepper to taste. Whisk the mixture well. Set aside. When the beets are done, remove them from the oven and let them cool for a few minutes so that they are easier to hold. Put on some disposable gloves (else get blood red stained fingers later). Open the foil-wrapped beets. Using the rough surface of each piece of foil, rub the beets with the foil to remove the skin. Cut the cooked beets into small pieces. Set aside in a bowl. Drizzle 2 tablespoons of vinaigrette into the beets. Add 2 teaspoons of honey. Toss well to coat the beets with the dressing. Slice the rested duck into thin slices. The meat should be a beautiful pink. Serve by layering the salad with greens, nuts and cheese of your choice, and the duck and beets. I like rocket greens with fresh basil or mint, mandarin orange segments, toasted almond flakes or pine nuts and some shaved parmesan cheese or some crumbed feta or goats cheese. Garnish with the orange zest. Trickle the vinaigrette over the salad. Best served immediately."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "duck breast meat - skin left on",
          "amount": "500 g(500g)"
        },
        {
          "name": "baby beets",
          "amount": "300 g(300g)"
        },
        {
          "name": "orange zest",
          "amount": "1 (1)"
        },
        {
          "name": "honey",
          "amount": "2 teaspoons(2tsps)"
        },
        {
          "name": "salt",
          "amount": "1 teaspoon(1tsp)"
        },
        {
          "name": "arugula greens",
          "amount": "3 cups(120g)"
        },
        {
          "name": "pine nuts",
          "amount": "4 tablespoons(4Tbsps)"
        },
        {
          "name": "mandarin orange segents",
          "amount": "1 can(1can)"
        },
        {
          "name": "mint",
          "amount": "1 Bunch(1Bunch)"
        },
        {
          "name": "feta cheese",
          "amount": "4 servings(4servings)"
        },
        {
          "name": "juice of orange",
          "amount": "6 (6)"
        },
        {
          "name": "extra virgin olive oil",
          "amount": "2 tablespoons(2Tbsps)"
        },
        {
          "name": "balsamic vinegar",
          "amount": "4 teaspoons(4tsps)"
        },
        {
          "name": "salt and pepper",
          "amount": "4 servings(4servings)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/664960-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 4,
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "primal"
      }
    ],
    "dishTypes": [
      {
        "en": "side dish"
      },
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "salad"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "oven"
      },
      {
        "en": "aluminum foil"
      },
      {
        "en": "frying pan"
      },
      {
        "en": "peeler"
      },
      {
        "en": "knife"
      },
      {
        "en": "stove"
      },
      {
        "en": "bowl"
      },
      {
        "en": "whisk"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/KD7D3V7L/warm-duck-salad-with-roasted-beetroot"
  },
  {
    "id": "RCAfqcbEbOMKpS4Fm85B",
    "title": {
      "en": "Vietnamese Pancakes with Vegetables, Herbs and a Fragrant Dipping Sauce (Bánh Xèo)"
    },
    "summary": {
      "en": "Vietnamese Pancakes with Vegetables, Herbs and a Fragrant Dipping Sauce (Bánh Xèo) requires roughly 45 minutes from start to finish. One serving contains 390 calories, 8g of protein, and 22g of fat. This gluten free, dairy free, and lacto ovo vegetarian recipe serves 6 and costs $3.19 per serving. Head to the store and pick up chilies, rice vinegar, enoki mushrooms, and a few other things to make it today. 295 people found this recipe to be yummy and satisfying. It works well as a side dish. Plenty of people really liked this Vietnamese dish. It is brought to you by foodandspice.blogspot.com. Overall, this recipe earns an awesome spoonacular score of 94%. Similar recipes include Bánh xèo (Vietnamese Happy Pancakes), Banh Xeo (Bánh Xèo) – Savory Vietnamese Crêpe, and Banh Xeo (Vietnamese Crepes)."
    },
    "instructions": {
      "en": [
        "Begin by preparing the pancake batter. Whisk together the rice flour, egg, sea salt, turmeric, cayenne and green chili. Gradually whisk in the coconut milk. The mixture should be a smooth, semi-thick batter that is of pouring consistency. Add a little water if necessary. Cover and set aside while you prepare the rest of the food.Now prepare the sauce. Whisk together all of the ingredients and set aside.For the filling, combine the carrot, radish, green onions, green chilies and snow peas. Put the herbs in another bowl and have your sprouts ready along with the mushrooms.Heat a teaspoon of oil over medium heat in a non-stick skillet. When hot, ladle 1/2 cup of batter into the pan and spread with the bottom of the ladle until you have a roughly 6 to 8 inch pancake. Fry for 6 to 8 minutes or until you have small holes forming and the bottom is crispy brown, then flip and fry for another few minutes on the other side. Transfer to a plate and keep warm in a 150 oven while you finish the rest of the pancakes you should finish with 4 to 6 pancakes.To serve, scatter a portion of the vegetables, herbs and mushrooms over one half of the pancake. Sprinkle some sauce over top and fold the pancake. Drizzle with more sauce and there you go."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "brown rice flour",
          "amount": "1.3333334 cups(210.667g)"
        },
        {
          "name": "brown sugar",
          "amount": "0.5 tablespoon(0.5Tbsps)"
        },
        {
          "name": "carrot",
          "amount": "1 large(1large)"
        },
        {
          "name": "cayenne",
          "amount": "1 pinch(1pinch)"
        },
        {
          "name": "coconut milk",
          "amount": "1.75 cups(395.5ml)"
        },
        {
          "name": "daikon radish",
          "amount": "1 medium(1medium)"
        },
        {
          "name": "egg",
          "amount": "1 (1)"
        },
        {
          "name": "enoki mushrooms",
          "amount": "1 cup(65ml)"
        },
        {
          "name": "basil leaves",
          "amount": "0.6666667 cup(16g)"
        },
        {
          "name": "ginger",
          "amount": "1 inch(1inch)"
        },
        {
          "name": "mint leaves",
          "amount": "0.25 cup(11.25g)"
        },
        {
          "name": "parsley",
          "amount": "1 cup(60g)"
        },
        {
          "name": "garlic",
          "amount": "1 clove(1clove)"
        },
        {
          "name": "chili",
          "amount": "1 (1)"
        },
        {
          "name": "chilies",
          "amount": "2 (2)"
        },
        {
          "name": "green onions",
          "amount": "4 (4)"
        },
        {
          "name": "juice of lime",
          "amount": "2 (2)"
        },
        {
          "name": "mung bean sprouts",
          "amount": "1 cup(104ml)"
        },
        {
          "name": "chilies",
          "amount": "2 (2)"
        },
        {
          "name": "rice vinegar",
          "amount": "1 tablespoon(1Tbsp)"
        },
        {
          "name": "sea salt",
          "amount": "0.5 teaspoon(0.5tsps)"
        },
        {
          "name": "sesame oil",
          "amount": "1.5 tablespoons(1.5Tbsps)"
        },
        {
          "name": "sesame oil",
          "amount": "6 servings(6servings)"
        },
        {
          "name": "snow peas",
          "amount": "1.5 cups(147g)"
        },
        {
          "name": "tamari sauce",
          "amount": "1 tablespoon(1Tbsp)"
        },
        {
          "name": "turmeric",
          "amount": "1 teaspoon(1tsp)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/716217-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 6,
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      },
      {
        "en": "lacto ovo vegetarian"
      }
    ],
    "dishTypes": [
      {
        "en": "side dish"
      }
    ],
    "cuisines": [
      {
        "en": "Vietnamese"
      },
      {
        "en": "Asian"
      }
    ],
    "equipment": [
      {
        "en": "whisk"
      },
      {
        "en": "bowl"
      },
      {
        "en": "frying pan"
      },
      {
        "en": "ladle"
      },
      {
        "en": "oven"
      }
    ],
    "sourceUrl": "https://www.foodandspice.com/2012/05/vietnamese-pancakes-with-vegetables.html"
  },
  {
    "id": "SoPs2xVSuTwWbYhDc2L9",
    "title": {
      "en": "Spaghetti With Pesto Trapanese"
    },
    "summary": {
      "en": "Spaghetti With Pesto Trapanese is a lacto ovo vegetarian recipe with 6 servings. For $1.46 per serving, this recipe covers 19% of your daily requirements of vitamins and minerals. One serving contains 433 calories, 14g of protein, and 15g of fat. Not a lot of people made this recipe, and 4 would say it hit the spot. Head to the store and pick up spaghetti, almonds, pine nuts, and a few other things to make it today. It works best as a main course, and is done in around 45 minutes. It is brought to you by Foodista. All things considered, we decided this recipe deserves a spoonacular score of 86%. This score is tremendous. Try Spaghetti with Pesto Trapanese, Pasta con il pesto alla Trapanese (Tomato and almond pesto), and Pasta con il pesto alla Trapanese (Tomato and almond pesto) for similar recipes."
    },
    "instructions": {
      "en": [
        "Place a large (this is key) pot of water to boil. Salt when it boils, not before. Meanwhile, make the pesto: In a mortar (or use a food processor with a blade) pound together the oil, almonds and pine-nuts. Add the garlic, 2 ice cubes and the rest of the ingredients, pounding quickly to make a paste.You want to leave a bit of a texture for crunch. Cook the pasta al dente, as per directions, drain and reserve some of the boiling water. Toss the pasta with the pesto, using some of the reserved water to make it creamier. Grate some fresh pecorino or ricotta salata (or both) over and serve hot with a leaf of basil to garnish."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "spaghetti",
          "amount": "1 pound(453.592g)"
        },
        {
          "name": "almonds",
          "amount": "0.5 cup(71.5g)"
        },
        {
          "name": "pine nuts",
          "amount": "0.25 cup(33.75g)"
        },
        {
          "name": "extra virgin olive oil",
          "amount": "0.5 cup(108ml)"
        },
        {
          "name": "garlic cloves",
          "amount": "3 (3)"
        },
        {
          "name": "tomatoes",
          "amount": "2 (2)"
        },
        {
          "name": "basil",
          "amount": "2.5 cups(60g)"
        },
        {
          "name": "salt and pepper",
          "amount": "6 servings(6servings)"
        },
        {
          "name": "pecorino",
          "amount": "6 servings(6servings)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/660835-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 6,
    "diets": [
      {
        "en": "lacto ovo vegetarian"
      }
    ],
    "dishTypes": [
      {
        "en": "side dish"
      },
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "pot"
      },
      {
        "en": "food processor"
      },
      {
        "en": "mortar and pestle"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/VWV2WXBJ/spaghetti-with-pesto-trapanese"
  },
  {
    "id": "WOyua5JrEEjKlMWkIbCx",
    "title": {
      "en": "Healthy Orange Chicken"
    },
    "summary": {
      "en": "Healthy Orange Chicken is a main course that serves 2. Watching your figure? This gluten free and dairy free recipe has 526 calories, 54g of protein, and 9g of fat per serving. For $3.19 per serving, this recipe covers 30% of your daily requirements of vitamins and minerals. Head to the store and pick up salt and pepper, garlic, soy sauce, and a few other things to make it today. 3 people found this recipe to be tasty and satisfying. It is brought to you by Foodista. From preparation to the plate, this recipe takes roughly 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 68%. This score is solid. Similar recipes are Healthy Orange Chicken, Healthy Orange Chicken, and Healthy Orange Chicken."
    },
    "instructions": {
      "en": [
        "Cut the chicken breast into cubes. In a mixing bowl, marinate the chicken with orange juice, rice vinegar, rice wine, hot chili sauce, brown sugar, and minced garlic. Cover the chicken with plastic wrap and press down so the marinade will soak the chicken evenly. Refrigerate for 1 hour. While waiting for the chicken to marinate, prepare the vegetables. Chop the onion into square pieces. Chop green onions and separate the white and green parts. Zest the orange. In a saut pan, add vegetable oil and turn to high heat. Add in the chicken and saut for 1 minute. Toss the chicken and saut for another minute or until caramelized. Transfer the chicken to a dish. Continue to use high heat. Add the chopped onion to the pan and saut until soft. Add the chicken back to the pan, with the white parts of the green onion and orange zest. Cook for about 30 seconds. Add the liquid to the pan and let it simmer to 30 seconds. Add the remaining green onion to the pan and let the sauce continue to reduce and thicken. When the sauce is reduced to desired consistency, add salt and pepper to taste. The orange chicken is done. Serve over white rice."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "chicken breast",
          "amount": "1 lb(453.592g)"
        },
        {
          "name": "vegetable oil",
          "amount": "1 tsp(1tsp)"
        },
        {
          "name": "orange juice",
          "amount": "0.25 cup(62ml)"
        },
        {
          "name": "rice vinegar",
          "amount": "0.25 cup(63.75ml)"
        },
        {
          "name": "rice wine",
          "amount": "1 tsp(1tsp)"
        },
        {
          "name": "soy sauce",
          "amount": "2 Tbs(2Tbs)"
        },
        {
          "name": "chili sauce",
          "amount": "1 Tbs(1Tbs)"
        },
        {
          "name": "garlic",
          "amount": "2 cloves(2cloves)"
        },
        {
          "name": "brown sugar",
          "amount": "1 Tbs(1Tbs)"
        },
        {
          "name": "orange zest",
          "amount": "2 Tbs(2Tbs)"
        },
        {
          "name": "green onions",
          "amount": "1 stalk(1stalk)"
        },
        {
          "name": "water",
          "amount": "0.25 cup(59.147ml)"
        },
        {
          "name": "corn starch",
          "amount": "1 tsp(1tsp)"
        },
        {
          "name": "salt and pepper",
          "amount": "2 servings(2servings)"
        },
        {
          "name": "rice",
          "amount": "2 servings(2servings)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/646499-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 2,
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      }
    ],
    "dishTypes": [
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "plastic wrap"
      },
      {
        "en": "mixing bowl"
      },
      {
        "en": "frying pan"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/TG73YMYD/healthy-orange-chicken"
  },
  {
    "id": "aN08qhxQ0xxnuBoVGda9",
    "title": {
      "en": "Healthy Vegan Red Velvet Brownies"
    },
    "summary": {
      "en": "Healthy Vegan Red Velvet Brownies is a dessert that serves 8. For 42 cents per serving, this recipe covers 8% of your daily requirements of vitamins and minerals. Watching your figure? This gluten free, dairy free, lacto ovo vegetarian, and vegan recipe has 181 calories, 5g of protein, and 5g of fat per serving. A mixture of baking soda, salt, ground flaxseed, and a handful of other ingredients are all it takes to make this recipe so tasty. 91 person found this recipe to be scrumptious and satisfying. A few people really liked this American dish. It is brought to you by Foodista. It is perfect for valentin day. From preparation to the plate, this recipe takes roughly 45 minutes. Taking all factors into account, this recipe earns a spoonacular score of 69%, which is good. Healthy Vegan Red Velvet Brownies, Healthy Red Velvet Quinoa Brownies, and Healthy Red Velvet Quinoa Brownies are very similar to this recipe."
    },
    "instructions": {
      "en": [
        "Step 1: Preheat oven to 350 F.",
        "Step 2: Spray an 8x8 inch pan with cooking spray. Set aside.",
        "Step 3: In a food processor, puree kidney beans and beets. Transfer to a large bowl.",
        "Step 4: Add remaining ingredients and mix by hand until smooth and fully combined.",
        "Step 5: Fold batter into the greased pan.",
        "Step 6: Bake for 35-40 minutes, turning the pan halfway through.",
        "Step 7: When the brownies are done, test them with a toothpick. You want some batter to cling to the toothpick. Do not over bake.",
        "Step 8: Let cool completely. Refrigerate for one hour.",
        "Step 9: Cut into squares or use cookie cutters to make heart shapes."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "almond extract",
          "amount": "0.5 tsp(0.5tsps)"
        },
        {
          "name": "apple sauce",
          "amount": "4 tablespoons(4Tbsps)"
        },
        {
          "name": "baking powder",
          "amount": "0.75 tsp(0.75tsps)"
        },
        {
          "name": "baking soda",
          "amount": "0.125 tsp(0.125tsps)"
        },
        {
          "name": "beets",
          "amount": "0.5 cup(68g)"
        },
        {
          "name": "brown sugar",
          "amount": "0.75 cup(165g)"
        },
        {
          "name": "cocoa powder",
          "amount": "0.5 cup(43g)"
        },
        {
          "name": "ground flaxseed",
          "amount": "0.5 cup(80g)"
        },
        {
          "name": "kidney beans",
          "amount": "1 cup(177g)"
        },
        {
          "name": "salt",
          "amount": "0.125 tsp(0.125tsps)"
        },
        {
          "name": "vanilla extract",
          "amount": "1 tsp(1tsp)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/646524-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 8,
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      },
      {
        "en": "lacto ovo vegetarian"
      },
      {
        "en": "vegan"
      }
    ],
    "dishTypes": [
      {
        "en": "dessert"
      }
    ],
    "cuisines": [
      {
        "en": "American"
      }
    ],
    "equipment": [
      {
        "en": "food processor"
      },
      {
        "en": "oven"
      },
      {
        "en": "frying pan"
      },
      {
        "en": "bowl"
      },
      {
        "en": "toothpicks"
      },
      {
        "en": "cookie cutter"
      }
    ],
    "sourceUrl": "http://www.foodista.com/recipe/YGBD7J2L/healthy-vegan-red-velvet-brownies"
  },
  {
    "id": "aexdAeIKAv70e7IUoMlP",
    "title": {
      "en": "Flank Steak with Mushroom Sauce"
    },
    "summary": {
      "en": "Flank Steak with Mushroom Sauce is a gluten free, primal, and ketogenic recipe with 4 servings. One serving contains 215 calories, 15g of protein, and 16g of fat. For $1.71 per serving, this recipe covers 12% of your daily requirements of vitamins and minerals. This recipe from Foodista requires garlic, butter, olive oil, and shallot. It will be a hit at your valentin day event. A few people really liked this main course. 72 people found this recipe to be yummy and satisfying. From preparation to the plate, this recipe takes around 45 minutes. Overall, this recipe earns a solid spoonacular score of 53%. Try Flank Steak with Mushroom Sauce, Flank Steak with Mushroom Sauce, and Flank Steak with Creamy Mushroom Sauce for similar recipes."
    },
    "instructions": {
      "en": [
        "Step 1: Heat 1 tablespoon oil in a 10-inch skillet over medium heat. Add the beef and cook until well browned on both sides and until desired doneness, about 10 minutes for medium-rare. Remove the beef from the skillet.",
        "Step 2: Heat 1 tablespoon butter and the remaining oil in the skillet. Add the mushrooms and cook for 5 minutes or until tender, stirring occasionally. Add the shallot, garlic and rosemary and cook and stir for 30 seconds. Stir in the concentrated broth, water and remaining butter and cook until the butter is melted.",
        "Step 3: Cut the beef diagonally against the grain into thin slices. Serve the mushroom mixture with the beef."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "flavor concentrated beef broth",
          "amount": "2 packets(2packets)"
        },
        {
          "name": "butter",
          "amount": "2 tablespoons(2Tbsps)"
        },
        {
          "name": "flank steak",
          "amount": "1 (1)"
        },
        {
          "name": "rosemary leaves",
          "amount": "1 tablespoon(1Tbsp)"
        },
        {
          "name": "garlic",
          "amount": "4 cloves(4cloves)"
        },
        {
          "name": "mushrooms",
          "amount": "3 cups(288ml)"
        },
        {
          "name": "olive oil",
          "amount": "2 tablespoons(2Tbsps)"
        },
        {
          "name": "shallot",
          "amount": "1 (1)"
        },
        {
          "name": "water",
          "amount": "0.25 cup(59.147ml)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/631750-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 4,
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "primal"
      },
      {
        "en": "ketogenic"
      }
    ],
    "dishTypes": [
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "frying pan"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/F4D23G25/flank-steak-with-mushroom-sauce"
  },
  {
    "id": "dGCSG5hjQUdTjLC4AOiC",
    "title": {
      "en": "Authentic Chicken Enchiladas"
    },
    "summary": {
      "en": "Forget going out to eat or ordering takeout every time you crave Mexican food. Try making Authentic Chicken Enchiladas at home. This recipe makes 12 servings with 370 calories, 24g of protein, and 11g of fat each. For $1.29 per serving, this recipe covers 17% of your daily requirements of vitamins and minerals. A couple people made this recipe, and 54 would say it hit the spot. From preparation to the plate, this recipe takes approximately 45 minutes. If you have pickled jalapeno in a jar), olive oil, enchilada sauce, and a few other ingredients on hand, you can make it. It works well as a main course. It is brought to you by Foodista. It is a good option if you're following a gluten free diet. With a spoonacular score of 70%, this dish is good. Similar recipes are Authentic Chicken Enchiladas, Authentic Chicken Enchiladas, and Authentic Chicken Enchiladas."
    },
    "instructions": {
      "en": [
        "Step 1: Season your thawed chicken breasts with salt and pepper. Add a little bit of olive oil to your frying pan, add chicken, and cook through. Remove chicken from pan, then add diced onions to the pan. Turn heat to medium and let onions saute through. (You may need to add a little bit more oil to the pan.)",
        "Step 2: Meanwhile, chop up your chicken (or shred) very finely. When the onions are soft and translucent, add chicken back to the pan. Season your onions and chicken with garlic, cumin, and chili powder. Finely chop up your jalapeno and add that and your green chilis to your chicken mixture. Stir in your cheese. Now you are ready to assemble.",
        "Step 3: Heat up your olive oil in a small frying pan. Add your corn tortilla for about 20 seconds, flipping if the oil doesn't reach the top side. Doing this softens your tortilla so it won't break as you roll it. Do this with all your tortillas and drain on paper towels.",
        "Step 4: Take 2 cookie sheets and spray with cooking spray. Lay out a tortilla and add about 2 TBSP of chicken mixture to the middle of your tortilla. Roll up. Fill the remaining tortillas in the same way and line them up next to each other on your cookie sheet, so they are very close to each other, but not touching. This should make two rows on each of your cookie sheets.",
        "Step 5: If two pans are too much for your family, then at this point, take one pan and put it in your freezer. Once the enchiladas are frozen, remove them from the pan and stack them in a double lined ziploc freezer bag. When you want to make them, simply line them up again on a greased cookie sheet, let thaw for about an hour on the counter, then bake as instructed.)",
        "Step 6: Now, bake your enchiladas in the oven, at 400 degrees, for about 20 minutes. They should be lightly browned. Remove them from the oven and spoon over about 2TBSP of your enchilada sauce over the top of each enchilada. Then sprinkle the tops with cheese. Put the enchiladas back in the oven for about 7 minutes. After that, it's time to eat!"
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "chicken breasts",
          "amount": "4 (4)"
        },
        {
          "name": "chili powder",
          "amount": "0.5 teaspoon(0.5tsps)"
        },
        {
          "name": "corn tortillas",
          "amount": "45 small(45small)"
        },
        {
          "name": "cumin",
          "amount": "0.25 teaspoon(0.25tsps)"
        },
        {
          "name": "enchilada sauce",
          "amount": "1 can(1can)"
        },
        {
          "name": "garlic powder",
          "amount": "1 teaspoon(1tsp)"
        },
        {
          "name": "chilis",
          "amount": "1 can(1can)"
        },
        {
          "name": "pickled jalapeno in a jar)",
          "amount": "0.5 (0.5)"
        },
        {
          "name": "olive oil",
          "amount": "3 tablespoons(3Tbsps)"
        },
        {
          "name": "onion",
          "amount": "1 (1)"
        },
        {
          "name": "salt and pepper",
          "amount": "12 servings(12servings)"
        },
        {
          "name": "mexican cheese blend",
          "amount": "1 cup(112g)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/633072-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 12,
    "diets": [
      {
        "en": "gluten free"
      }
    ],
    "dishTypes": [
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [
      {
        "en": "Mexican"
      }
    ],
    "equipment": [
      {
        "en": "frying pan"
      },
      {
        "en": "baking sheet"
      },
      {
        "en": "paper towels"
      },
      {
        "en": "oven"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/BXBVZXM8/authentic-chicken-enchiladas"
  },
  {
    "id": "fZWt8w3ApVz56dehLGg2",
    "title": {
      "en": "Gluten Free Fruit Stuffed Turkey Breast with Hibiscus Sauce"
    },
    "summary": {
      "en": "Gluten Free Fruit Stuffed Turkey Breast with Hibiscus Sauce might be a good recipe to expand your main course repertoire. One portion of this dish contains roughly 47g of protein, 11g of fat, and a total of 466 calories. This gluten free recipe serves 4 and costs $4.15 per serving. It is brought to you by Foodista. 8 people were glad they tried this recipe. Head to the store and pick up kosher salt, hibiscus petals, ground pepper, and a few other things to make it today. From preparation to the plate, this recipe takes roughly 45 minutes. Overall, this recipe earns a good spoonacular score of 78%. Similar recipes include Gluten-free Roast Turkey Breast And Avocado Cream On A Bed Of G, Porcini & Sage Roasted Turkey Breast – Low Carb & Gluten Free, and Rolled Stuffed Turkey Breast & Creamy Basil Sauce."
    },
    "instructions": {
      "en": [
        "Step 1: For the Turkey:",
        "Step 2: Method: Preheat oven to 350 degrees. Slit a pocket laterally in the turkey breast. Julienne the dried fruit and the spinach and mix in a bowl with the chopped shallot. Stuff the mixture into the turkey breast and season with salt and pepper, coat with the melted butter and wrap in sheet of foil. Heat a large skillet until it is very hot and place the turkey in the pan and allow to cook for about two minutes on each side or until it is golden brown on all sides (you will have to peek inside the foil to check). Place the pan in the oven and cook for 15 minutes then flip the breasts and cook for an additional 20 to 30 minutes or until a probe thermometer inserted into the middle of the breast reads 165 degrees. Remove the pan from the oven and place the pan on a cutting board and allow to rest for five minutes. Remove the turkey from the foil then carve into 1 inch thick medallions",
        "Step 3: For the sauce:",
        "Step 4: Method: In a non-reactive saucepan bring the vinegar and the sugar to a boil. Cook the mixture till the sugar begins to caramelize (Brown). Add the Stock to the mixture quickly so that the caramel does not burn then add the hibiscus flowers to the pan and bring to a low boil. Allow the mixture to reduce by then whisk in the cornstarch with the mixture still at a low boil. Season the sauce to taste with the salt then strain the sauce through a chinoix or fine sauce strainer.",
        "Step 5: To serve: Place a 1 oz. pool of the sauce on a plate and fan the carved turkey over the sauce."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "butter",
          "amount": "2 Tbs(2Tbs)"
        },
        {
          "name": "cornstarch",
          "amount": "1 Tbs(1Tbs)"
        },
        {
          "name": "apricots",
          "amount": "0.5 cup(65g)"
        },
        {
          "name": "cranberries",
          "amount": "0.5 cup(60.606g)"
        },
        {
          "name": "pineapple",
          "amount": "0.5 cup(80g)"
        },
        {
          "name": "ground pepper",
          "amount": "4 servings(4servings)"
        },
        {
          "name": "hibiscus petals",
          "amount": "0.25 cup(59.147ml)"
        },
        {
          "name": "kosher salt",
          "amount": "4 servings(4servings)"
        },
        {
          "name": "salt",
          "amount": "4 servings(4servings)"
        },
        {
          "name": "shallot",
          "amount": "1 Tbs(1Tbs)"
        },
        {
          "name": "spinach leaves",
          "amount": "2 cups(60g)"
        },
        {
          "name": "sugar",
          "amount": "2 tsp(2tsps)"
        },
        {
          "name": "lobe turkey breast",
          "amount": "1 (1)"
        },
        {
          "name": "turkey stock",
          "amount": "2 cups(473.176ml)"
        },
        {
          "name": "vinegar",
          "amount": "3 Tbs(3Tbs)"
        },
        {
          "name": "foil",
          "amount": "1 (1)"
        },
        {
          "name": "foil",
          "amount": "1 (1)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/644828-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 4,
    "diets": [
      {
        "en": "gluten free"
      }
    ],
    "dishTypes": [
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "bowl"
      },
      {
        "en": "aluminum foil"
      },
      {
        "en": "oven"
      },
      {
        "en": "frying pan"
      },
      {
        "en": "kitchen thermometer"
      },
      {
        "en": "cutting board"
      },
      {
        "en": "sauce pan"
      }
    ],
    "sourceUrl": "http://www.foodista.com/recipe/TG5HY8N2/gluten-free-fruit-stuffed-turkey-breast-with-hibiscus-sauce"
  },
  {
    "id": "fa3mVtyPJNCVpKL7ZKCW",
    "title": {
      "en": "Grilled Eggplant and Heirloom Tomato Stacks With Basil and Tomato Coulis"
    },
    "summary": {
      "en": "Grilled Eggplant and Heirloom Tomato Stacks With Basil and Tomato Coulis is a gluten free and primal side dish. One portion of this dish contains about 12g of protein, 17g of fat, and a total of 238 calories. This recipe serves 5. For $2.51 per serving, this recipe covers 13% of your daily requirements of vitamins and minerals. This recipe from Foodista has 8 fans. If you have garlic clove, tomato coulis, eggplant, and a few other ingredients on hand, you can make it. The Fourth Of July will be even more special with this recipe. From preparation to the plate, this recipe takes roughly 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 84%. This score is super. Grilled Eggplant and Heirloom Tomato Stacks With Basil and Tomato Coulis, Grilled Eggplant & Tomato Stacks, and Grilled Eggplant, Tomato and Feta Stacks are very similar to this recipe."
    },
    "instructions": {
      "en": [
        "Step 1: Prepare Tomato Coulis:",
        "Step 2: Make shallow incisions with a paring knife around the tomato stems and scoop out the stems.",
        "Step 3: Make a shallow X-incision in bottom of tomatoes.",
        "Step 4: Bring a large saucepan of water to a rolling boil.",
        "Step 5: Plunge tomatoes into water for 10 seconds.",
        "Step 6: Remove and submerge tomatoes in bowl of ice water.",
        "Step 7: Remove the cooled tomatoes from the water.",
        "Step 8: Peel away skin.",
        "Step 9: Remove seeds and coarsely chop tomatoes.",
        "Step 10: Combine tomatoes, garlic and olive oil in bowl of food processor.",
        "Step 11: Process until smooth.",
        "Step 12: Add salt and pepper.",
        "Step 13: Let Tomato Coulis stand at room temperature for one hour before serving.",
        "Step 14: Prepare Eggplant:",
        "Step 15: Preheat oven broiler or prepare grill.",
        "Step 16: Lightly brush eggplant slices on both sides with olive oil.",
        "Step 17: Sprinkle with salt and pepper.",
        "Step 18: Arrange on baking tray and grill in oven, turning once, until golden brown, about 3 minutes per side.",
        "Step 19: Or grill on barbecue, turning, until golden brown and cooked through.",
        "Step 20: Arrange Stacks:",
        "Step 21: Combine garlic and goat cheese in a small bowl.",
        "Step 22: Add salt and freshly ground black pepper to taste.",
        "Step 23: Arrange 1/2 of the eggplant slices on platter.",
        "Step 24: Spoon 2 teaspoons goat cheese over.",
        "Step 25: Top with 1 basil leaf.",
        "Step 26: Place second eggplant slice on basil leaf.",
        "Step 27: Top with one teaspoon goat cheese and basil leaf.",
        "Step 28: Lightly drizzle 2-3 teaspoons Tomato Coulis over and around the eggplant stack.",
        "Step 29: Garnish with one teaspoon grated Pecorino Romano cheese.",
        "Step 30: Serve immediately."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "basil leaves",
          "amount": "15 large(15large)"
        },
        {
          "name": "pepper",
          "amount": "5 servings(5servings)"
        },
        {
          "name": "eggplant",
          "amount": "1 large(1large)"
        },
        {
          "name": "garlic clove",
          "amount": "1 small(1small)"
        },
        {
          "name": "mild goat cheese",
          "amount": "1 cup(227g)"
        },
        {
          "name": "olive oil",
          "amount": "2 tablespoons(2Tbsps)"
        },
        {
          "name": "pecorino romano cheese",
          "amount": "0.25 cup(25g)"
        },
        {
          "name": "plum tomatoes",
          "amount": "8 ounces(226.796g)"
        },
        {
          "name": "salt",
          "amount": "5 servings(5servings)"
        },
        {
          "name": "tomato coulis",
          "amount": "0.75 cup(111.75g)"
        },
        {
          "name": "garden tomatoes",
          "amount": "2 large(2large)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/645696-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 5,
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "primal"
      }
    ],
    "dishTypes": [
      {
        "en": "side dish"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "sauce pan"
      },
      {
        "en": "knife"
      },
      {
        "en": "bowl"
      },
      {
        "en": "food processor"
      },
      {
        "en": "broiler"
      },
      {
        "en": "grill"
      },
      {
        "en": "oven"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/WXQZBFHK/grilled-eggplant-and-heirloom-tomato-stacks-with-basil-and-tomato-coulis"
  },
  {
    "id": "gbYicWgaK3OAI1FpfgSp",
    "title": {
      "en": "Frozen Mojito Pie"
    },
    "summary": {
      "en": "Frozen Mojito Pie requires about 45 minutes from start to finish. For $1.41 per serving, you get a dessert that serves 8. One portion of this dish contains approximately 4g of protein, 20g of fat, and a total of 319 calories. Head to the store and pick up mint, whipped topping, sugar, and a few other things to make it today. It is brought to you by Foodista. 3 people were impressed by this recipe. Overall, this recipe earns a rather bad spoonacular score of 13%. If you like this recipe, take a look at these similar recipes: Frozen Mojito Pie, FROZEN MOJITO, and Frozen Strawberry Watermelon Mojito."
    },
    "instructions": {
      "en": [
        "In a medium sized bowl mix together the pretzel crumbs and the butter. Press the pretzels onto the bottom of an 8-inch springform pan, or a round pan lined with plastic wrap. Freeze the crust for at least one hour. In your mixers bowl, beat together the cream cheese, sugar, zest, juice, and mint. Mix until well blended. Whisk in the whipped topping. Spoon the filling over the crust. Freeze for at least 6 hours. Over night is best. Carefully remove the pie from the pan and top it with some crushed pretzels and thin slices of lime. Keep it frozen."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "pretzels",
          "amount": "1 cup(80g)"
        },
        {
          "name": "butter",
          "amount": "5 tablespoons(5Tbsps)"
        },
        {
          "name": "cream cheese",
          "amount": "8 oz(226.796g)"
        },
        {
          "name": "sugar",
          "amount": "0.75 cup(150g)"
        },
        {
          "name": "lime zest",
          "amount": "1 large(1large)"
        },
        {
          "name": "juice from lime",
          "amount": "1 large(1large)"
        },
        {
          "name": "mint",
          "amount": "3 tablespoons(3Tbsps)"
        },
        {
          "name": "whipped topping",
          "amount": "2 cups(150ml)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/643916-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 8,
    "diets": [],
    "dishTypes": [
      {
        "en": "dessert"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "bowl"
      },
      {
        "en": "springform pan"
      },
      {
        "en": "plastic wrap"
      },
      {
        "en": "whisk"
      },
      {
        "en": "frying pan"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/G245TF5X/frozen-mojito-pie"
  },
  {
    "id": "gi6O2ycCDo6jDy1A4SlP",
    "title": {
      "en": "Luscious Lemon Bars"
    },
    "summary": {
      "en": "You can never have too many dessert recipes, so give Luscious Lemon Bars a try. This recipe serves 6. One portion of this dish contains roughly 4g of protein, 18g of fat, and a total of 463 calories. For 53 cents per serving, this recipe covers 4% of your daily requirements of vitamins and minerals. 31 person have made this recipe and would make it again. If you have flour, butter, eggs, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. It is a good option if you're following a lacto ovo vegetarian diet. From preparation to the plate, this recipe takes about 45 minutes. All things considered, we decided this recipe deserves a spoonacular score of 16%. This score is rather bad. Similar recipes include Luscious Lemon Bars, Luscious Lemon Bars, and Luscious Lemon Bars."
    },
    "instructions": {
      "en": [
        "Step 1: PREHEAT oven to 350F",
        "Step 2: GREASE 9x13 inch rectangular cake pan",
        "Step 3: COMBINE crust ingredients and press with fingertips into pan",
        "Step 4: BAKE for 20 minutes",
        "Step 5: FILLING: As crust is baking combine all remaining ingredients and whisk together until well combined.",
        "Step 6: When crust is baked, remove from oven, fill with lemon filling; return to oven",
        "Step 7: BAKE for an addition 23-25 minutes (don't let the top get overbrown - see pic above for what you are looking for!)",
        "Step 8: REMOVE from oven and allow to cool for 1/2 hr on a wire rack.",
        "Step 9: Tip: To remove from baking pan, cut the bars in half and remove each half with a large flexible spatula. Then finish cutting bars into squares",
        "Step 10: DUST with sifted icing sugar and you are DONE.",
        "Step 11: Last steps - VERY IMPORTANT: Put on a pot of tea and I will be there shortly ;)",
        "Step 12: See recipe PLUS photos @ my blog: http://lemondropsfoodie.blogspot.com/2011/02/luscious-lemon-bars.html"
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "baking powder",
          "amount": "0.5 teaspoon(0.5tsps)"
        },
        {
          "name": "butter",
          "amount": "4 ounces(113.398g)"
        },
        {
          "name": "eggs",
          "amount": "3 (3)"
        },
        {
          "name": "flour",
          "amount": "50 g(50g)"
        },
        {
          "name": "juice of lemon",
          "amount": "1 (1)"
        },
        {
          "name": "lemon zest",
          "amount": "1 tablespoon(1Tbsp)"
        },
        {
          "name": "powdered sugar",
          "amount": "0.5 cup(60g)"
        },
        {
          "name": "sugar",
          "amount": "1.75 cups(350g)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/650479-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 6,
    "diets": [
      {
        "en": "lacto ovo vegetarian"
      }
    ],
    "dishTypes": [
      {
        "en": "dessert"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "baking pan"
      },
      {
        "en": "wire rack"
      },
      {
        "en": "spatula"
      },
      {
        "en": "whisk"
      },
      {
        "en": "oven"
      },
      {
        "en": "pot"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/N6WG5MLX/luscious-lemon-bars"
  },
  {
    "id": "l9AJSLh3JHEpdhPjtcON",
    "title": {
      "en": "Boeuf Bourgignon"
    },
    "summary": {
      "en": "Boeuf Bourgignon takes around 45 minutes from beginning to end. For $8.41 per serving, you get a main course that serves 4. One portion of this dish contains approximately 76g of protein, 54g of fat, and a total of 980 calories. This recipe is liked by 2 foodies and cooks. If you have beef stock, flour, thyme, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. Overall, this recipe earns a solid spoonacular score of 78%. Boeuf Bourgignon, Slow Cooker Boeuf Bourgignon, and Slow Cooker Boeuf Bourgignon are very similar to this recipe."
    },
    "instructions": {
      "en": [
        "Preheat oven to 160 C (325 F). In a pan saut the mushrooms in butter till brown and soft. Keep aside. In a deep-bottomed pot/cesserole, saut the bacon in 1 tbsp oil over moderate heat for 2 to 3 minutes to brown lightly. Remove to a side dish with a slotted spoon. Reheat the pan until fat is almost smoking before you saut the beef. Saut the beef in the bacon fat in batches making sure not to crowd the pieces (the pieces need to brown on all sides, not sweat). Add the browned pieces of beef to the bacon. Lower the heat to medium. In the same fat, add the onions, shallots and carrots. Cook till the carrots soften. Add the cooked veggies to the beef and bacon. Pour out the sauting fat. Return beef to the casserole. Then sprinkle on the flour and toss to coat the beef lightly with the flour. Stir everything around till the flour is cooked and no white traces of it remain. Add the bacon and veggies and season with salt and pepper. Stir in the cognac and enough stock so that the meat is barely covered. Add the garlic, thyme, parsley, tomato paste and bay leaf. Bring to simmer on top of the stove. Cover the casserole and set it in the oven. Cook for 2 1/2 to 3 hours. About 1 hour into the cooking add the mushrooms and stir in the cocoa powder. Return to the oven. The stew is done when the meat is fork-soft."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "button mushrooms",
          "amount": "1 pound(453.592g)"
        },
        {
          "name": "butter",
          "amount": "2 tbsp(2Tbsps)"
        },
        {
          "name": "un-smoked bacon",
          "amount": "2 strips(2strips)"
        },
        {
          "name": "vegetable oil",
          "amount": "1 tbsp(1Tbsp)"
        },
        {
          "name": "well-trimmed beef chuck",
          "amount": "3 pounds(1.361kgs)"
        },
        {
          "name": "onion",
          "amount": "1 medium(1medium)"
        },
        {
          "name": "shallots",
          "amount": "2 medium(2medium)"
        },
        {
          "name": "carrots",
          "amount": "2 medium(2medium)"
        },
        {
          "name": "salt and pepper",
          "amount": "4 servings(4servings)"
        },
        {
          "name": "flour",
          "amount": "1 tbsp(1Tbsp)"
        },
        {
          "name": "cognac",
          "amount": "1 cup(240ml)"
        },
        {
          "name": "beef stock",
          "amount": "3 cups(720ml)"
        },
        {
          "name": "cocoa powder",
          "amount": "2 tbsp(2Tbsps)"
        },
        {
          "name": "garlic cloves",
          "amount": "2 (2)"
        },
        {
          "name": "thyme",
          "amount": "2 teaspoons(2tsps)"
        },
        {
          "name": "flat-leaf parsley leaves",
          "amount": "0.25 cup(15g)"
        },
        {
          "name": "tomato paste",
          "amount": "1 tbsp(1Tbsp)"
        },
        {
          "name": "bay leaf",
          "amount": "1 (1)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/635574-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 4,
    "diets": [],
    "dishTypes": [
      {
        "en": "lunch"
      },
      {
        "en": "main course"
      },
      {
        "en": "main dish"
      },
      {
        "en": "dinner"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "oven"
      },
      {
        "en": "frying pan"
      },
      {
        "en": "pot"
      },
      {
        "en": "slotted spoon"
      },
      {
        "en": "stove"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/CHYFGP78/boeuf-bourgignon"
  },
  {
    "id": "pJ8OIPgbIeyWbq70WE6U",
    "title": {
      "en": "Eggplant Parmesan Roll-Ups"
    },
    "summary": {
      "en": "Eggplant Parmesan Roll-Ups might be just the hor d'oeuvre you are searching for. This recipe serves 4. One serving contains 669 calories, 21g of protein, and 45g of fat. For $3.63 per serving, this recipe covers 25% of your daily requirements of vitamins and minerals. If you have olive oil, basil, garlic, and a few other ingredients on hand, you can make it. It is a pretty expensive recipe for fans of Mediterranean food. 2 people found this recipe to be yummy and satisfying. From preparation to the plate, this recipe takes approximately 45 minutes. It is brought to you by Foodista. All things considered, we decided this recipe deserves a spoonacular score of 78%. This score is pretty good. If you like this recipe, take a look at these similar recipes: Eggplant Roll-Ups, Grilled Eggplant Roll-Ups, and Eggplant and Mozzarella Roll-Ups."
    },
    "instructions": {
      "en": [
        "Preheat oven to 350F and put water for linguine on to boil. Heat 1 teaspoon oil in a 2-quart heavy saucepan over medium heat and add onion and green pepper. Cook until just tender. Add garlic and red pepper flakes and continue to cook another 30 seconds. Add tomatoes and 1/2 teaspoon salt and simmer, uncovered, stirring occasionally, until slightly thickened, 15 to 20 minutes. Grill eggplant while sauce cooks. Heat grill pan over high heat until hot. Peel skin from eggplant and discard. Cut eggplant long-ways into 8 (1/3-inch-thick) slices. Lightly rush both sides of slices with 2 teaspoons oil (total), then season with salt and pepper. Grill slices in batches, turning over once l, until golden brown and tender, about 4 minutes, then transfer to a tray. Stir together ricotta and 1/2 cup Parmesan, basil, pepper, and remaining salt. Divide cheese mixture among slices. Roll up each slice. Place rolls in a small casserole dish and bake until cheese starts to melt, about 10 minutes. Meanwhile, cook linguine to package directions. Serve rolls over linguine, topped with sauce and sprinkled with 1 tablespoon Parmesan each."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "olive oil",
          "amount": "3 cups(648ml)"
        },
        {
          "name": "bell pepper",
          "amount": "1 large(1large)"
        },
        {
          "name": "brown mushrooms",
          "amount": "8 ounces(226.796g)"
        },
        {
          "name": "garlic",
          "amount": "1 clove(1clove)"
        },
        {
          "name": "pepper flakes",
          "amount": "0.25 teaspoon(0.25tsps)"
        },
        {
          "name": "canned tomatoes",
          "amount": "14 teaspoons(14tsps)"
        },
        {
          "name": "eggplant",
          "amount": "1.25 lb(566.99g)"
        },
        {
          "name": "ricotta",
          "amount": "1 cup(248g)"
        },
        {
          "name": "parmesan",
          "amount": "0.5 cup(50g)"
        },
        {
          "name": "basil",
          "amount": "3 tablespoons(3Tbsps)"
        },
        {
          "name": "pepper",
          "amount": "0.25 teaspoon(0.25tsps)"
        },
        {
          "name": "linguine",
          "amount": "6 ounces(170.097g)"
        },
        {
          "name": "onion",
          "amount": "0.5 cup(80g)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/642297-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 4,
    "diets": [],
    "dishTypes": [
      {
        "en": "antipasti"
      },
      {
        "en": "starter"
      },
      {
        "en": "snack"
      },
      {
        "en": "appetizer"
      },
      {
        "en": "antipasto"
      },
      {
        "en": "hor d'oeuvre"
      }
    ],
    "cuisines": [
      {
        "en": "Mediterranean"
      },
      {
        "en": "Italian"
      },
      {
        "en": "European"
      }
    ],
    "equipment": [
      {
        "en": "oven"
      },
      {
        "en": "sauce pan"
      },
      {
        "en": "grill"
      },
      {
        "en": "grill pan"
      },
      {
        "en": "casserole dish"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/JWBD7XBC/eggplant-parmesan-roll-ups"
  },
  {
    "id": "pyDRKtQABixMOIF79xio",
    "title": {
      "en": "Banana in brown sugar ice cream"
    },
    "summary": {
      "en": "You can never have too many hor d'oeuvre recipes, so give Bananan in brown sugar ice cream a try. One serving contains 343 calories, 3g of protein, and 17g of fat. For 98 cents per serving, this recipe covers 9% of your daily requirements of vitamins and minerals. This recipe serves 6. It is a good option if you're following a gluten free, dairy free, lacto ovo vegetarian, and fodmap friendly diet. A mixture of vanillan extract, lemon juice, full-fat cream, and a handful of other ingredients are all it takes to make this recipe so flavorful. 5 people were glad they tried this recipe. Summer will be even more special with this recipe. From preparation to the plate, this recipe takes around 45 minutes. It is brought to you by Foodista. Taking all factors into account, this recipe earns a spoonacular score of 42%, which is pretty good. Similar recipes are Banana-brown Sugar Ice Cream, Spiced Banana & Brown Sugar Ice Cream, and Brown Sugar Bananan Ice Cream with Brownie Chunks."
    },
    "instructions": {
      "en": [
        "Step 1: In a wide skillet or saucepan, heat the brown sugar with one-quarter of the coconut milk or sour cream, stirring, until smooth and bubbly.",
        "Step 2: Add the bananas and salt, and continue to cook for 5 minutes, stirring occasionally, until the bananas are soft and completely cooked through.",
        "Step 3: Remove from heat and stir in the remaining coconut milk or sour cream, rum and vanilla. If it tastes too sweet, add a few drops of fresh lemon juice.",
        "Step 4: Puree in a blender or food processor until completely smooth.",
        "Step 5: Chill thoroughly for 1 hour or overnight, then pour into the ice cream maker and proceed according to the manufacturers instructions.",
        "Step 6: Before serving, take it out for 5-10 minutes before serving, or longer, so it comes to the right scooping temperature",
        "Step 7: Light note: if you use sour cream, when cooking the bananas, the mixture might curdle a bit. Nothing to worry, just proceed with the recipe and itll smooth out when blended.",
        "Step 8: Easy suggestion: ice cream is best served in chilled glass or porcelain bowls. Scoop it with a hot, but dry, ice-cream spoon (soak it in boiling water, then wipe dry)."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "bananas",
          "amount": "600 g(600g)"
        },
        {
          "name": "rum",
          "amount": "1 tsp(1tsp)"
        },
        {
          "name": "full-fat cream",
          "amount": "500 ml(500ml)"
        },
        {
          "name": "lemon juice",
          "amount": "6 servings(6servings)"
        },
        {
          "name": "brown sugar",
          "amount": "135 g(135g)"
        },
        {
          "name": "big of sea salt",
          "amount": "1 pinch(1pinch)"
        },
        {
          "name": "vanilla extract",
          "amount": "1 tablespoon(1Tbsp)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/634106-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 6,
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      },
      {
        "en": "lacto ovo vegetarian"
      },
      {
        "en": "fodmap friendly"
      },
      {
        "en": "vegan"
      }
    ],
    "dishTypes": [
      {
        "en": "antipasti"
      },
      {
        "en": "starter"
      },
      {
        "en": "snack"
      },
      {
        "en": "appetizer"
      },
      {
        "en": "antipasto"
      },
      {
        "en": "hor d'oeuvre"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "sauce pan"
      },
      {
        "en": "frying pan"
      },
      {
        "en": "ice cream machine"
      },
      {
        "en": "food processor"
      },
      {
        "en": "blender"
      },
      {
        "en": "bowl"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/P56TQ84Z/banana-in-brown-sugar-ice-cream"
  },
  {
    "id": "tdO5xa2kVFNJ5sk0pOpb",
    "title": {
      "en": "Pumpkin soup with wine"
    },
    "summary": {
      "en": "Pumpkin soup with wine might be a good recipe to expand your hor d'oeuvre collection. This recipe makes 4 servings with 461 calories, 3g of protein, and 28g of fat each. For $5.13 per serving, this recipe covers 4% of your daily requirements of vitamins and minerals. 14 people have made this recipe and would make it again. A mixture of sage leaves, red wine, vegetable stock from 1 cube, and a handful of other ingredients are all it takes to make this recipe so yummy. Autumn will be even more special with this recipe. It is a good option if you're following a gluten free and lacto ovo vegetarian diet. It is brought to you by Foodista. From preparation to the plate, this recipe takes around 45 minutes. With a spoonacular score of 13%, this dish is rather bad. Users who liked this recipe also liked Red Wine Braised Venison over Pumpkin Risotto, Ginger and Wine Poached Pears with Pumpkin Whipped Cream, and Pumpkin Ravioli In A Parmesan Fondue With A Red Wine Reduction."
    },
    "instructions": {
      "en": [
        "Cut the pumpkin into large chunks, and place on a parchment or foil-lined baking sheet. Drizzle with oil and roast at 200C until fork-tender and golden. In a blender mash the roasted pumpkin until smooth. Transfer into a soup pot. Add cream, sour cream, wine and vegetable stock, stir and combine. Bring the soup to a boil, then immediately remove from the flame. Sprinkle with chopped fresh sage leaves serve with croutons."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "muscat pumpkin",
          "amount": "750 g(750g)"
        },
        {
          "name": "cream",
          "amount": "200 g(200g)"
        },
        {
          "name": "cream",
          "amount": "200 g(200g)"
        },
        {
          "name": "vegetable stock from 1 cube",
          "amount": "500 ml(500ml)"
        },
        {
          "name": "sage leaves",
          "amount": "4 servings(4servings)"
        },
        {
          "name": "red wine",
          "amount": "150 ml(150ml)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/657384-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 4,
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "lacto ovo vegetarian"
      }
    ],
    "dishTypes": [
      {
        "en": "soup"
      },
      {
        "en": "antipasti"
      },
      {
        "en": "starter"
      },
      {
        "en": "snack"
      },
      {
        "en": "appetizer"
      },
      {
        "en": "antipasto"
      },
      {
        "en": "hor d'oeuvre"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "baking sheet"
      },
      {
        "en": "aluminum foil"
      },
      {
        "en": "blender"
      },
      {
        "en": "pot"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/ZTMMHNGC/pumpkin-soup-with-wine"
  },
  {
    "id": "wNI52eh4v6GLMWOpxVsH",
    "title": {
      "en": "Asian Chickpea Lettuce Wraps"
    },
    "summary": {
      "en": "The recipe Asian Chickpea Lettuce Wraps could satisfy your Asian craving in approximately 45 minutes. Watching your figure? This gluten free and dairy free recipe has 52 calories, 1g of protein, and 3g of fat per serving. For 30 cents per serving, you get a hor d'oeuvre that serves 6. If you have basil, rice vinegar, hoison sauce, and a few other ingredients on hand, you can make it. 15 people have tried and liked this recipe. It is brought to you by Foodista. All things considered, we decided this recipe deserves a spoonacular score of 66%. This score is solid. Similar recipes are Asian Chickpea Lettuce Wraps, Asian Lettuce Wraps, and Asian Lettuce Wraps."
    },
    "instructions": {
      "en": [
        "Drain and rinse both cans of chickpeas. Place chickpeas in a food processor and puree in 5-10 second increments. You do not want to turn the chickpeas into a mash, you simply want to grind them into pieces. Add 1 tbsp of olive oil to a pan and heat. Add the chickpeas and let cook over medium heat for 3-4 minutes, continuously stirring so as not to burn. Add remaining ingredients, except basil, and stir. Cook over low heat for 10 minutes, stirring occassionally. If using basil leaves, add them and cook for 1-2 minutes, stirring the basil in and allowing it to wilt. Wash lettuce leaves and pat dry. Spoon a healthy serving of chickpea mixture onto lettuce wraps and serve immediately. Drizzle with sirachi sauce if desired."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "chickpeas",
          "amount": "2 oz(56.699g)"
        },
        {
          "name": "chili sauce",
          "amount": "1 tbsp(1Tbsp)"
        },
        {
          "name": "hoison sauce",
          "amount": "2 tbsp(2Tbsps)"
        },
        {
          "name": "soy sauce",
          "amount": "1 tbsp(1Tbsp)"
        },
        {
          "name": "olive oil",
          "amount": "1 tbsp(1Tbsp)"
        },
        {
          "name": "rice vinegar",
          "amount": "2 tbsp(2Tbsps)"
        },
        {
          "name": "sugar",
          "amount": "0.5 tbsp(0.5Tbsps)"
        },
        {
          "name": "pepper flakes",
          "amount": "1 tsp(1tsp)"
        },
        {
          "name": "sirachi sauce",
          "amount": "1 tbsp(1Tbsp)"
        },
        {
          "name": "basil",
          "amount": "0.5 cup(12g)"
        },
        {
          "name": "romaine leaves",
          "amount": "6 (6)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/632819-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 6,
    "diets": [
      {
        "en": "gluten free"
      },
      {
        "en": "dairy free"
      }
    ],
    "dishTypes": [
      {
        "en": "antipasti"
      },
      {
        "en": "starter"
      },
      {
        "en": "snack"
      },
      {
        "en": "appetizer"
      },
      {
        "en": "antipasto"
      },
      {
        "en": "hor d'oeuvre"
      }
    ],
    "cuisines": [
      {
        "en": "Asian"
      }
    ],
    "equipment": [
      {
        "en": "food processor"
      },
      {
        "en": "frying pan"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/88WZSMJ6/asian-chickpea-lettuce-wraps"
  },
  {
    "id": "yMMKPi2W2mbErwqZsj1m",
    "title": {
      "en": "Chocolate Wafers"
    },
    "summary": {
      "en": "Chocolate Wafers might be a good recipe to expand your dessert recipe box. For 5 cents per serving, this recipe covers 1% of your daily requirements of vitamins and minerals. This recipe makes 40 servings with 30 calories, 1g of protein, and 1g of fat each. 10 people have tried and liked this recipe. If you have ap flour, baking soda, cocoa powder, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. From preparation to the plate, this recipe takes approximately 45 minutes. Overall, this recipe earns an improvable spoonacular score of 8%. Chocolate Mint Wafers, Chocolate Caramel Wafers, and Chocolate Peppermint Wafers are very similar to this recipe."
    },
    "instructions": {
      "en": [
        "Step 1: Combine the flour, cocoa, baking soda, and salt in a small bowl and mix together thoroughly with a whisk or fork. Set aside.",
        "Step 2: Beat the butter and margarine with an electric mixer for a few seconds just until blended.",
        "Step 3: Add the granulated sugar, brown sugar, and vanilla and beat at high speed for about 1 minute.",
        "Step 4: Beat in the egg white.",
        "Step 5: Add the flour mixture and mix on low speed, just until incorporated.",
        "Step 6: Gather the dough together with your hands and form it into a 9- to 10-inch log.",
        "Step 7: Wrap the log in wax paper or foil. Fold or twist the ends of the paper without pinching or flattening the log",
        "Step 8: Refrigerate for at least 45 minutes, or until needed.",
        "Step 9: Preheat the oven to 350F. Position racks in the upper and lower thirds of the oven.",
        "Step 10: Use a sharp knife to cut the dough log into slices a scant 1/4\" thick.",
        "Step 11: Place 1 inch apart on cookie sheets and bake for 12 - 14 minutes, or until the cookies puff and crackle on top, then begin to settle down slightly.",
        "Step 12: Rotate baking sheets from top to bottom and front to back about halfway through the baking time to ensure even baking.",
        "Step 13: Slide the parchment or foil onto cooling racks and cool the cookies completely before storing or stacking."
      ]
    },
    "ingredients": {
      "en": [
        {
          "name": "ap flour",
          "amount": "1 cup(125g)"
        },
        {
          "name": "baking soda",
          "amount": "0.25 teaspoon(0.25tsps)"
        },
        {
          "name": "brown sugar",
          "amount": "0.5 cup(110g)"
        },
        {
          "name": "egg white",
          "amount": "1 large(1large)"
        },
        {
          "name": "margarine",
          "amount": "3 teaspoons(3tsps)"
        },
        {
          "name": "salt",
          "amount": "0.25 teaspoon(0.25tsps)"
        },
        {
          "name": "butter",
          "amount": "3 teaspoons(3tsps)"
        },
        {
          "name": "cocoa powder",
          "amount": "0.5 cup(43g)"
        },
        {
          "name": "vanilla extract",
          "amount": "1 teaspoon(1tsp)"
        }
      ]
    },
    "image": "https://img.spoonacular.com/recipes/639234-556x370.jpg",
    "readyInMinutes": 45,
    "servings": 40,
    "diets": [],
    "dishTypes": [
      {
        "en": "dessert"
      }
    ],
    "cuisines": [],
    "equipment": [
      {
        "en": "hand mixer"
      },
      {
        "en": "whisk"
      },
      {
        "en": "bowl"
      },
      {
        "en": "wax paper"
      },
      {
        "en": "aluminum foil"
      },
      {
        "en": "knife"
      },
      {
        "en": "oven"
      },
      {
        "en": "baking sheet"
      }
    ],
    "sourceUrl": "https://www.foodista.com/recipe/PFD62V3L/chocolate-wafers"
  }
]